export const DESCRIPTIONS: string[] = [
  'موجودی کیف‌پول شما می‌تواند شامل نقدی یا هدیه باشد. تنها مبالغی که از حساب بانکی به کیف‌پول واریز شده‌اند، در موجودی نقدی قابل برداشت هستند.',
  'موجودی‌های دیگر، مثل کارت‌های هدیه افزوده شده یا مبالغی که از سازمان خود برای خرید کالا دریافت کرده‌اید، فقط قابل خرج شدن هستند و نمی‌توانید آن‌ها را به حساب بانکی منتقل کنید.',
  'شما می‌توانید همه موجودی کیف‌پول، ازجمله هدیه و نقدی را در دیجی‌پی، دیجی‌کالا، جت، فیدیبو و... خرج کنید و محدودیتی برای خرج کردن موجودی وجود ندارد.',
];
