import { FaqCategoryTypeEnum } from '../../../../data-access/enums/faq-category-type.enum';

export const FAQ_ITEMS = {
  [FaqCategoryTypeEnum.THIRD_PARTY_VEHICLE]: [
    {
      id: 0,
      title: 'هزینه بیمه شخص ثالث چقدر است؟',
      description: 'نرخ پایه بیمه شخص ثالث هر سال توسط بیمه مرکزی اعلام می‌شود و برای هر نوع وسیله نقلیه متفاوت است. مبلغ نهایی بیمه باتوجه به نوع وسیله نقلیه ، تعداد سیلندر، کاربری، سال ساخت، سقف تعهد مالی و میزان تخفیف عدم خسارت تعیین می‌شود.'
    },
    {
      id: 1,
      title: 'چرا قیمت بیمه در شرکت‌های مختلف متفاوت است؟',
      description: 'هر شرکت بیمه بر اساس سیاست‌های فروش و طرح‌های ترویجی خودش، نرخ متفاوتی ارائه می‌دهد. همه قیمت‌ها تحت نظارت بیمه مرکزی هستند، اما خدمات و سیاست های ترویجی ممکن است فرق داشته باشند.'
    },
    {
      id: 2,
      title: 'آیا تعداد سیلندر یا کاربری وسیله نقلیه در قیمت بیمه تأثیر دارد؟',
      description: 'بیمه شخص ثالث خسارت‌های جانی و مالی واردشده به اشخاص ثالث را جبران می‌کند. منظور از شخص ثالث، هر فردی غیر از راننده‌ی مقصر و مالک خودرو است که در اثر حادثه‌ی رانندگی دچار آسیب بدنی یا خسارت مالی شود. خسارت‌های وارده به خودروی راننده‌ی مقصر تحت پوشش این بیمه قرار نمی‌گیرد. پوشش‌ها شامل موارد زیر است:\n' +
        '۱. خسارت‌های مالی اشخاص ثالث\n' +
        '۲. خسارت‌های جانی اشخاص ثالث\n' +
        '۳. حوادث راننده‌ی مقصر'
    },
    {
      id: 3,
      title: 'آیا راننده مقصر هم تحت پوشش است؟',
      description: 'بله. راننده مقصر از نظر خسارت‌های جانی تحت پوشش قرار دارد، اما خسارت مالی وسیله نقلیه ی او فقط با بیمه بدنه جبران می‌شود.'
    },
    {
      id: 4,
      title: 'کدام خسارت‌ها از شمول پوشش بیمه شخص ثالث خارج‌اند؟',
      description: '    • خسارت به وسیله نقلیه ی مقصر یا محموله آن\n' +
        '    • رانندگی بدون گواهینامه یا در حالت مستی\n' +
        '    • خسارت عمدی یا ناشی از جنگ و شورش\n' +
        '    • تغییر کاربری وسیله نقلیه بدون اطلاع بیمه‌گر'
    },
    {
      id: 5,
      title: 'سقف تعهدات در سال ۱۴۰۴ چقدر است؟',
      description: 'تعهد جانی: ۱ میلیارد و ۶۰۰ میلیون تومان\n' +
        'تعهد راننده مقصر: ۱ میلیارد و ۲۰۰ میلیون تومان\n' +
        'تعهد مالی: بین ۵۳ میلیون تا ۱ میلیارد و ۶۶ میلیون تومان (قابل انتخاب)'
    },
    {
      id: 6,
      title: 'تخفیف عدم خسارت چطور محاسبه می‌شود؟',
      description: 'هر سالی که خسارتی اعلام نکنید، ۵٪ تخفیف به بیمه‌نامه شما اضافه می‌شود (تا سقف ۷۰٪ برای ۱۴ سال بدون خسارت.)'
    },
    {
      id: 7,
      title: 'در صورت بروز خسارت، تخفیف‌ها از بین می‌روند؟',
      description: 'خیر. طبق قانون جدید، تخفیف‌ها پلکانی کاهش می‌یابند. در خسارات مالی بین ۲۰٪ تا ۴۰٪ و برای خسارت جانی بین ۳۰٪ تا ۱۰۰٪ بنا بر دفعات تکرار حادثه کاهش می‌یابد.'
    },
    {
      id: 8,
      title: 'آیا می‌توان تخفیف‌ها را به وسیله نقلیه ی جدید یا افراد دیگر منتقل کرد؟',
      description: 'بله. انتقال فقط در این موارد ممکن است:\n' +
        '۱. از وسیله نقلیه ی فروخته‌شده یا اسقاط‌شده به وسیله نقلیه ی جدید همان مالک (به شرط یکسان بودن نوع وسیله نقلیه ، مثلاً سواری به سواری) \n' +
        '۲. بین بستگان درجه ‌یک به شرط اینکه سند به نام آن‌ها باشد. (پدر، مادر، فرزند، همسر)'
    },
    {
      id: 9,
      title: 'مدارک لازم برای انتقال تخفیف چیست؟',
      description: 'تاریخچه پلاک، بیمه‌نامه قبلی، سند وسیله نقلیه جدید، کارت ملی مالک، فرم درخواست انتقال یا الحاقیه فسخ'
    },
    {
      id: 10,
      title: 'آیا می‌توان تخفیف دو بیمه‌نامه را با هم جمع کرد؟',
      description: 'خیر، ادغام تخفیف‌ها در قانون بیمه شخص ثالث مجاز نیست.'
    },
    {
      id: 11,
      title: 'برای تمدید بیمه شخص ثالث چه‌کار کنم؟',
      description: 'کافی است وارد حساب کاربری دیجی‌پی شوید، بیمه قبلی خود را مشاهده کنید و از میان شرکت‌های مختلف، گزینه مناسب را انتخاب کنید. تاریخ انقضا هم به‌صورت خودکار یادآوری می‌شود تا جریمه نشوید.'
    },
    {
      id: 12,
      title: 'آیا لازم است تخفیف‌ها را هنگام تمدید وارد کنم؟',
      description: 'خیر. دیجی‌پی تخفیف‌های شما را به‌صورت خودکار از سامانه بیمه مرکزی استعلام می‌کند.'
    },
    {
      id: 13,
      title: 'زمان صدور بیمه‌نامه چقدر است؟',
      description: 'اگر خریدتان تا قبل از ساعت ۲۱ انجام شود، بیمه‌نامه همان روز یا حداکثر یک روز کاری بعد صادر می‌شود.',
    },
    {
      id: 14,
      title: 'آیا نسخه الکترونیکی بیمه‌نامه معتبر است؟',
      description: 'بله. طبق بخشنامه بیمه مرکزی و پلیس راهور، نسخه دیجیتال و کد یکتای پیامکی کفایت می‌کند و نیازی به نسخه چاپی نیست.',
    },
    {
      id: 15,
      title: 'آیا می‌توانم برای شخص دیگری بیمه بخرم؟',
      description: 'بله. شما می‌توانید با حساب کاربری خودتان برای هر شخص دیگری بیمه بخرید.',
    },
    {
      id: 17,
      title: 'در صورت لغو بیمه، پول چه زمانی بازگردانده می‌شود؟',
      description: 'پس از تأیید لغو، مبلغ طی ۲۴ تا ۴۸ ساعت کاری به حسابتان برمی‌گردد.'
    },
    {
      id: 18,
      title: 'قانون جدید افت قیمت وسیله نقلیه چیست؟',
      description: 'از دی‌ماه ۱۴۰۳، بیمه شخص ثالث خسارت افت قیمت خودرو را هم جبران می‌کند \n' +
        'سقف پرداخت تا ۲۰٪ ارزش روز خودرو\n' +
        'فقط برای خودروهای زیر ۱۰ سال ساخت\n' +
        'بدون افزایش حق بیمه'
    },
    {
      id: 19,
      title: 'پرداخت خسارت خودروهای لوکس چگونه است؟',
      description: 'اگر ارزش خودرو بیش از نصف دیه کامل باشد، فقط تا سقف گران‌ترین خودروی متعارف خسارت پرداخت می‌شود که در سال ۱۴۰۴ معادل دنا پلاس دنده‌ای است.'
    },
    {
      id: 20,
      title: 'مراحل دریافت خسارت بیمه شخص ثالث چیست؟',
      description: '۱. تماس با پلیس و دریافت کروکی رسمی\n' +
        '۲. مراجعه به مرکز ارزیابی خسارت\n' +
        '۳. تحویل مدارک (کارت خودرو، بیمه‌نامه، گواهینامه، کارت ملی و کروکی)\n' +
        '۴. بررسی کارشناس بیمه\n' +
        '۵. پرداخت خسارت به زیان‌دیده یا تعمیرگاه'
    },
    {
      id: 21,
      title: 'چطور می توانم بیمه نامه شخص ثالث خود را بعد از صدور دریافت کنم؟',
      description: 'پس از صدور بیمه نامه، نسخه الکترونیکی آن از دو روش قابل دریافت است:\n' +
        'از طریق بخش «بیمه های من» در حساب کاربری دیجی پی:\n' +
        'با ورود به حساب کاربری و مراجعه به بخش «بیمه های من»، می توانید نسخه الکترونیکی بیمه نامه را مشاهده و دانلود کنید.\n' +
        'از طریق پیامک ارسالی دیجی پی:\n' +
        'لینکی برای شما پیامک می شود که با ورود به آن، می توانید نسخه الکترونیکی بیمه نامه را دانلود کنید.\n' +
        'نسخه الکترونیکی بیمه نامه معتبر است و برای تمام امور قانونی مرتبط با بیمه شخص ثالث قابل استفاده است.'
    }
  ],
  [FaqCategoryTypeEnum.THIRD_PARTY_BODY]: [
    {
      id: 0,
      title: 'بیمه بدنه چیست؟',
      description: 'بیمه بدنه، یک بیمه نامه اختیاری است که خسارت‍‍‌‍‍های فیزیکی واردشده به خودروی شما را جبران می‍‍‌‍‍کند؛ چه مقصر حادثه‌‌' +
        'باشید یا خیر. ‌​' +
        'توجه داشته باشید که بیمه بدنه فقط خسارات وارد بر خودروی بیمه شده را پوشش می‍‍‌‍‍دهد و شامل خسارات جانی یا خسارات‌‌' +
        'وارد به اموال و خودروهای دیگر نمی‍‍‌‍‍شود.'
    },
    {
      id: 1,
      title: 'چرا باید بیمه بدنه تهیه کنم؟',
      description: 'در صورت بروز حوادثی مانند ‌‌تصادف، واژگونی، آتش سوزی، سرقت یا بلایای طبیعی، هزینه تعمیر یا جایگزینی خودرو‌‌' +
        'بسیار سنگین خواهد بود. بیمه بدنه این هزینه ها را پوشش می‍‍‌‍‍دهد و برای خودروهای گران‍‍‌‍‍قیمت یا نامتعارف اهمیت بیشتری‌‌' +
        'دارد.'
    },
    {
      id: 2,
      title: 'آیا بیمه بدنه اجباری است؟',
      description: 'خیر، اجباری نیست. اما تهیه آن در کنار بیمه شخص ثالث، امنیت و آرامش بیشتری برای مالک خودرو فراهم می‍‍‌‍‍آورد.'
    },
    {
      id: 3,
      title: 'پوشش‍‍‌‍‍های اصلی بیمه بدنه چیست؟',
      description:
        '    • سرقت کلی خودرو\n' +
        '    • خسارت ناشی از تصادف، واژگونی یا سقوط\n' +
        '    • آتش‍‍سوزی، انفجار و صاعقه\n' +
        '    • خسارت هنگام حمل و نجات خودرو\n' +
        '    • آسیب به لاستیک و باتری (تا ‌‌۵۰‌‌٪ ارزش نو و فقط در صورت وقوع حادثه، نه استهلاک عادی)\n'
    },
    {
      id: 4,
      title: 'پوشش‍‍‌‍‍های اضافی قابل انتخاب کدام است؟',
      description: 'با پرداخت حق بیمه بیشتر، می‍‍‌‍‍توانید پوشش‍‍‌‍‍های زیر را اضافه کنید:\n' +
        '    • سرقت قطعات و لوازم (مانند آینه، رادیو، رینگ و لاستیک)\n' +
        '    • شکست شیشه به دلایل غیر از حادثه\n' +
        '    • پاشیدن رنگ یا مواد شیمیایی\n' +
        '    • بلایای طبیعی مانند زلزله، سیل و آتشفشان\n' +
        '    • پوشش نوسان قیمت خودرو\n' +
        '    • جبران خسارت ناشی از کشیده شدن میخ روی بدنه\n' +
        '    • حذف فرانشیز (با توجه به شرایط و با افزایش حق بیمه)\n' +
        'نکته: حتی در صورت حذف فرانشیز، برخی خسارت‍‍‌‍‍ها همچنان فرانشیز خواهند داشت (مثلاً خسارت ناشی از راننده زیر‌‌' +
        '۲۵‌‌ سال.)'
    },
    {
      id: 5,
      title: 'آیا امکان انتخاب همه پوشش‍‍‌‍‍های اضافی وجود دارد؟',
      description: 'بله، ولی هزینه هر پوشش جداگانه محاسبه می‍‍‌‍‍شود و برخی پوشش‍‍‌‍‍ها تنها توسط شرکت‍‍‌‍‍های خاص ارائه می‍‍‌‍‍گردد.'
    },
    {
      id: 6,
      title: 'چه خسارت‍‍‌‍‍هایی به هیچ عنوان جبران نمی‍‍‌‍‍شود؟',
      description:
        '    • خسارت عمدی توسط مالک یا راننده\n' +
        '    • جنگ، شورش یا اعتصاب\n' +
        '    • رانندگی بدون گواهینامه یا در حالت مستی\n' +
        '    • تشعشعات هسته‍‍‌‍‍ای یا انفجار اتمی\n' +
        '    • حمل بار بیش از حد مجاز یا بکسل غیرمجاز\n' +
        '    • شرکت در مسابقه یا تست سرعت\n' +
        '    • استفاده غیرمجاز یا خلاف مقررات از خودرو (مثلاً آموزش رانندگی بدون مجوز)\n'
    },
    {
      id: 7,
      title: 'آیا افت قیمت خودرو پوشش داده می‍‍‌‍‍شود؟',
      description: 'خیر، مگر در برخی شرکت‍‍‌‍‍ها و فقط برای خودروهای زیر ‌‌۷‌‌ سال با خرید پوشش اضافی.‌​' +
        'معیار سن خودرو و درصد افت قیمت توسط کارشناس بیمه تعیین می‍‍‌‍‍شود.'
    },
    {
      id: 8,
      title: 'آیا کشیدن میخ روی بدنه خودرو تحت پوشش است؟',
      description: 'تنها در صورت خرید پوشش اضافی مربوطه، این خسارت جبران می‍‍‌‍‍شود.'
    },
    {
      id: 9,
      title: 'چه خودروهایی امکان بیمه شدن ندارند؟',
      description:
        'به طور معمول:\n' +
        '    • خودروهای معمولی با بیش از ‌‌۲۰‌‌ سال عمر\n' +
        '    • پراید و پیکان با بیش از ‌‌۱۵‌‌ سال عمر‌\n' +
        '    • تشعشعات هسته‍‍‌‍‍ای یا انفجار اتمی\n' +
        '(این شرایط بسته به شرکت بیمه متفاوت است و توصیه می‍‍‌‍‍شود قبل از خرید، استعلام گرفته شود.)'
    },
    {
      id: 10,
      title: 'آیا خودروهای بالای ‌‌۱۰‌‌ سال قابل بیمه هستند؟',
      description: 'بله، اما حق بیمه آن‍‍‌‍‍ها بالاتر است. معمولاً به ازای هر سال سن بیش از ‌‌۱۰‌‌ سال، حدود ‌‌۵‌‌٪ به حق بیمه افزوده می‍‍‌‍‍شود.'
    },
    {
      id: 11,
      title: 'آیا امکان خرید اقساطی وجود دارد؟',
      description: 'بله، خرید اقساطی از طریق اعتبار دیجی پی امکان‍‍‌‍‍پذیر است.'
    },
    {
      id: 12,
      title: 'آیا بازدید خودرو قبل از خرید بیمه بدنه الزامی است؟',
      description: 'بله. هدف از بازدید، ثبت وضعیت فعلی خودرو و جلوگیری از اختلاف در زمان خسارت است. روش‍‍‌‍‍های بازدید:\n' +
        '    • ارسال عکس توسط خود مالک طبق دستورالعمل\n' +
        '    • بازدید حضوری توسط کارشناس (فقط در تهران)\n' +
        '    • مراجعه به مراکز مشخص شده در سطح شهر\n'
    },
    {
      id: 13,
      title: 'تخفیف های بیمه بدنه شامل چه مواردی است؟',
      description: '•    تخفیف عدم خسارت: \n' +
        '&nbsp;&nbsp;&nbsp;-   ۱‌‌ سال: ‌‌۲۵‌‌ تا ‌‌۳۰‌‌٪ \n' +
        '    &nbsp;&nbsp;&nbsp;- ۲‌‌ سال: ‌‌۳۵‌‌ تا ‌‌۴۰‌‌٪ \n' +
        '    &nbsp;&nbsp;&nbsp;- ۳‌‌ سال: ‌‌۴۵‌‌ تا ‌‌۵۰‌‌٪ \n' +
        '    &nbsp;&nbsp;&nbsp;- ۴‌‌ سال: ‌‌۶۰‌‌٪ \n' +
        '    &nbsp;&nbsp;&nbsp;- ۵‌‌ سال: ‌‌۷۰‌‌٪ \n' +
        '•    تخفیف خودروی صفر کیلومتر: تا ‌‌۳۰‌‌٪ \n' +
        '•    تخفیف پرداخت نقدی \n' +
        'مجموع تخفیف‍‍‌‍‍ها ممکن است محدودیت داشته باشد (مثلاً حداکثر ‌‌۷۰‌‌٪).'
    },
    {
      id: 14,
      title: 'آیا امکان انتقال تخفیف بیمه بدنه وجود دارد؟',
      description: 'بله، در صورتی که: \n' +
        '    • هر دو خودرو به نام یک فرد باشد، یا\n' +
        '    • مالک جدید از بستگان درجه یک باشد (پدر، مادر، همسر، فرزند)\n' +
        '    • نوع کاربری و تعداد سیلندر خودروها یکسان باشد\n'
    },
    {
      id: 15,
      title: 'آیا با تغییر شرکت بیمه، تخفیف از بین می‍‍‌‍‍رود؟',
      description: 'خیر. اما خودرو باید مجدداً بازدید شود.'
    },
    {
      id: 16,
      title: 'آیا می‍‍‌‍‍توانم بیمه بدنه را فسخ کنم؟',
      description: 'بله. فسخ از سوی بیمه گذار یا شرکت بیمه باید کتبی اعلام شود و بیمه نامه تا ‌‌۱۰‌‌ روز پس از اعلام معتبر است.'
    },
    {
      id: 17,
      title: 'آیا حق بیمه پس از فسخ بازگردانده می‍‍‌‍‍شود؟',
      description: 'بله، حق بیمه به صورت روزشمار محاسبه و مبلغ باقی‍‍‌‍‍مانده به حساب بیمه گذار واریز می‍‍‌‍‍شود.'
    },
    {
      id: 18,
      title: 'مدارک لازم برای دریافت خسارت چیست؟',
      description: '    • اصل بیمه نامه بدنه\n' +
        '    • کد یکتای بیمه شخص ثالث\n' +
        '    • کارت ملی و گواهینامه راننده\n' +
        '    • شناسنامه مالک خودرو\n' +
        '    • کروکی یا گزارش پلیس (در صورت نیاز)\n' +
        '    • فاکتور هزینه های حمل و تعمیر\n' +
        'شرکت بیمه ممکن است مدارک تکمیلی دیگری مانند عکس از محل حادثه درخواست کند.'
    },
    {
      id: 19,
      title: 'تفاوت خسارت کلی و جزئی چیست؟',
      description:
        '    • خسارت کلی:‌‌ سرقت کامل یا خسارت بیش از ‌‌۷۵‌‌٪ ارزش خودرو\n' +
        '    • خسارت جزئی:‌‌ خسارت کمتر از ‌‌۷۵‌‌٪ ارزش خودرو که بر اساس هزینه تعمیر محاسبه می‍‍‌‍‍شود\n'
    },
    {
      id: 20,
      title: 'آیا امکان دریافت خسارت سیار وجود دارد؟',
      description: 'بله. برخی شرکت‍‍‌‍‍ها کارشناس بیمه را به محل حادثه اعزام می‍‍‌‍‍کنند تا بررسی و پرداخت خسارت انجام شود.'
    },
    {
      id: 21,
      title: 'فرانشیز چیست؟',
      description: 'بخشی از خسارت است که بیمه گذار موظف به پرداخت آن است.‌​\n' +
        'مثال: اگر فرانشیز ‌‌۱۰‌‌٪ باشد و خسارت ‌‌۵۰‌‌ میلیون تومان، شرکت بیمه ‌‌۴۵‌‌ میلیون تومان پرداخت می‍‍‌‍‍کند.'
    },
    {
      id: 22,
      title: 'میزان فرانشیز در پوشش‍‍‌‍‍های مختلف چقدر است؟',
      description:
        '    • تصادف: ‌‌۱۰‌‌٪\n' +
        '    • خسارت کلی: ‌‌۱۰‌‌٪\n' +
        '    • سرقت کلی: ‌‌۲۰‌‌٪\n' +
        '    • خسارت ناشی از مواد شیمیایی: ‌‌۳۰‌‌٪\n' +
        '    • شکست شیشه: ‌‌۲۰‌‌٪\n' +
        '    • بلایای طبیعی: ‌‌۱۰‌‌٪\n'
    },
    {
      id: 23,
      title: 'آیا امکان حذف فرانشیز وجود دارد؟',
      description: 'بله، اما فقط در برخی شرکت‍‍‌‍‍ها و با استعلام ریسک. در این حالت حق بیمه افزایش می‍‍‌‍‍یابد.'
    },
    {
      id: 24,
      title: 'عوامل مؤثر بر قیمت بیمه بدنه چیست؟ \n',
      description: '    • تصادف: ‌‌۱۰‌‌٪\n' +
        '    • سال ساخت، نوع و ارزش خودرو\n' +
        '    • نوع کاربری\n' +
        '    • تعداد سیلندر\n' +
        '    • انتخاب پوشش‍‍‌‍‍های اضافی\n' +
        '    • سابقه عدم خسارت و تخفیف‍‍‌‍‍ها\n' +
        'یادآوری: بیمه بدنه صرفاً خسارات فیزیکی وارد به خودرو را پوشش می‍‍‌‍‍دهد و هزینه های جانی یا خسارات به اموال‌‌' +
        'دیگران تحت پوشش نیست.'
    },
    {
      id: 25,
      title: 'در چه مواقعی نیازی به کروکی نیست؟',
      description: 'وقتی خسارت مالی کمتر از سقف تعیین شده توسط قانون (مثلاً ‌‌۴۰‌‌ میلیون تومان در سال ‌‌۱۴۰۳‌‌) باشد.‌​' +
        'این سقف بر اساس نرخ دیه و قوانین سالانه تغییر می‍‍‌‍‍کند.'
    },
    {
      id: 26,
      title: 'در چه مواقعی کروکی لازم است؟',
      description: '    • خسارت بالاتر از سقف قانونی\n' +
        '    • خسارت جانی\n' +
        '    • تصادف با خودرو غیر بومی\n' +
        '    • تصادف زنجیره ای\n' +
        '    • تصادف با خودرو سنگین\n' +
        '    • عبور از چراغ قرمز\n'
    },
    {
      id: 27,
      title: 'زمان پرداخت خسارت چقدر است؟',
      description: '    • خسارت جزئی: حداکثر ‌‌۱۵‌‌ روز\n' +
        '    • خسارت کلی: حداکثر ‌‌۲‌‌ ماه\n' +
        'این زمان منوط به تکمیل مدارک و تأیید کارشناس بیمه است.'
    },
    {
      id: 28,
      title: 'آیا پس از فروش خودرو می‍‍‌‍‍توان بیمه بدنه را فسخ کرد؟',
      description: 'بله. در این حالت حق بیمه باقیمانده به صورت روزشمار محاسبه و به حساب مالک بازگردانده می‍‍‌‍‍شود.'
    },
  ],
  [FaqCategoryTypeEnum.EQUIPMENT]: [
    {
      id: 0,
      title: 'بیمه‌نامه تجهیزات دیجیتال چه خسارت‌هایی را پوشش می‌دهد؟',
      description: 'بسته به روش خرید دستگاه (نو از دیجی‌کالا، کارکرده و...)، بیمه‌نامه می‌تواند همه یا بخشی از خسارت‌های زیر را پوشش دهد:\n' +
        '    • ضربه، شکستگی کلی یا جزئی و صدمات فیزیکی واردشده به دستگاه\n' +
        '    • آب‌خوردگی، نم‌زدگی، زنگ‌زدگی و رسوب‌زدگی که باعث ازکارافتادگی دستگاه شود\n' +
        '    • سوختگی، نیم‌سوز شدن، دودزدگی و خسارات ناشی از استعمال دخانیات\n' +
        '    • آتش‌سوزی، صاعقه و انفجار از هر نوع (شامل خسارات ناشی از اطفای حریق)\n' +
        '    • القای الکتریکی، اتصال کوتاه و نوسانات برق\n' +
        '    • سرقت و حوادث مرتبط با آن (مطابق شرایط بیمه‌نامه)\n' +
        '    • سهل‌انگاری، استفاده نادرست یا اعمال عمدی و مخرب توسط اشخاص ثالث\n' +
        '    • حوادث طبیعی مانند سیل، طوفان، طغیان رودخانه، تگرگ و رانش زمین (به‌استثنای زمین‌لرزه)\n' +
        'توجه: پرداخت خسارت در صورت سرقت، منوط به ثبت مفقودی در سامانه همیاب و انتقال مالکیت دستگاه به شرکت بیمه است.'
    },
    {
      id: 1,
      title: 'بیمه‌نامه تجهیزات دیجیتال چه مواردی را تحت پوشش قرار نمی‌دهد؟',
      description: 'رخدادها و خسارات ناشی از موارد زیر تحت پوشش بیمه نیست:\n' +
        '    • عیوب نرم‌افزاری و خسارات وارده به سیستم‌عامل دستگاه\n' +
        '    • آثار خراشیدگی روی سطوح گوشی، صفحه‌نمایش و لنز دوربین، در صورتی که بر عملکرد دستگاه تأثیر منفی نداشته باشد\n' +
        '    • خسارت وارده به لوازم جانبی (شارژر، کابل شارژ، باتری، هدست و...)\n' +
        '    • خرابی دیسک سخت یا هارد اکسترنال بر اثر ضربه یا تکان ناگهانی\n' +
        '    • باز شدن دستگاه توسط مراکز خدمات غیراستاندارد\n' +
        '    • مخدوش یا ناخوانا بودن شماره سریال دستگاه\n' +
        '    • خساراتی که تولیدکننده مسئول آن است (عیوب ذاتی)\n' +
        '    • هزینه‌های مربوط به تبدیل به احسن دستگاه'
    },
    {
      id: 2,
      title: 'تفاوت گارانتی و بیمه در چیست؟',
      description: 'گارانتی تعهد شرکت سازنده برای تعمیر یا تعویض دستگاه در صورت وجود نقص ساخت در یک بازهٔ زمانی مشخص است. گارانتی خسارات ناشی از حوادث غیرمترقبه مانند تصادف یا سرقت را پوشش نمی‌دهد.\n' +
        'بیمه موبایل لایه‌ای حفاظتی فراتر از گارانتی است و شامل خسارات ناشی از تصادف، سرقت، آسیب‌های ناشی از مایعات و سایر حوادث می‌شود.\n' +
        'مثلاً اگر صفحه‌نمایش گوشی به‌دلیل نقص ساخت از کار بیفتد، گارانتی آن را پوشش می‌دهد؛ اما اگر بر اثر سقوط ترک بخورد، تنها بیمه آن را جبران می‌کند.'
    },
    {
      id: 3,
      title: 'چگونه می‌توانم بیمه‌نامه خود را مشاهده یا دریافت کنم؟',
      description: 'پس از خرید و وارد کردن شماره سریال دستگاه (IMEI)، می‌توانید بیمه‌نامه را از طریق بخش سفارش‌های پروفایل دیجی‌کالا یا پنل کاربری بیمه به نشانی:\n' +
        '<a href="https://dgpy.ir/ak2" target="_blank">dgpy.ir/ak2</a>' +
        '&nbsp;مشاهده یا دریافت کنید.'
    },
    {
      id: 4,
      title: 'مبلغ حق بیمه بر چه اساسی تعیین می‌شود؟',
      description: 'بر اساس ارزش اعلام‌شده توسط شما برای دستگاه تعیین می‌گردد.'
    },
    {
      id: 5,
      title: 'کدام تجهیزات را می‌توان با دیجی‌پی بیمه کرد؟',
      description: 'در حال حاضر امکان بیمه کردن موبایل کارکرده، و موبایل، لپ‍‍‌‍‍تاپ، تبلت و کنسول‍‍‌‍‍های بازی نو در هنگام خرید از‌‌ ' +
        'پلتفرم دیجی‍‍‌‍‍کالا فراهم است'
    },
    {
      id: 6,
      title: 'آیا بیمه‌نامه‌ای که با کالای الکترونیکی از دیجی‌کالا خریده‌ام، فعال است؟',
      description: 'در صورت پرداخت حق بیمه، با ورود به پروفایل دیجی‌کالا و ثبت شماره سریال دستگاه در بخش «تجهیزات الکترونیک»، بیمه‌نامه فعال می‌شود و امکان دانلود آن فراهم است.\n' +
        'توجه داشته باشید که اعتبار بیمه‌نامه از لحظهٔ خرید آغاز می‌شود.'
    },
    {
      id: 7,
      title: 'آیا امکان تمدید بیمه‌نامه وجود دارد؟',
      description: 'بله؛ در صورتی که کمتر از ۳۰ روز از اعتبار باقی مانده باشد، امکان تمدید از طریق پنل کاربری وجود دارد.'
    },
    {
      id: 8,
      title: 'چگونه می‌توان بیمه‌نامه را به شخص دیگری انتقال داد؟',
      description: 'از طریق پنل کاربری به نشانی:\n' +
        '<a href="https://dgpy.ir/ak2" target="_blank">dgpy.ir/ak2</a>'
    },
    {
      id: 9,
      title: 'اگر دستگاه به نام شخص دیگری باشد ولی بیمه‌نامه به نام من، مشکلی ایجاد می‌شود؟',
      description: 'خیر؛ معیار اعتبار بیمه‌نامه، تطابق شماره سریال (IMEI) ثبت‌شده با دستگاه ارائه‌شده است.'
    },
    {
      id: 10,
      title: 'چگونه می‌توانم اعلام خسارت کنم؟',
      description: 'از طریق پنل کاربری به‌صورت آنلاین یا تماس با کارشناسان بیمه، امکان ثبت خسارت وجود دارد.'
    },
    {
      id: 11,
      title: 'آیا برای استفاده از بیمه‌نامه نیاز به مراجعه حضوری است؟',
      description: 'خیر؛ تمام مراحل ثبت و پیگیری خسارت به‌صورت آنلاین یا تلفنی انجام می‌شود.'
    },
    {
      id: 12,
      title: 'برای دریافت خسارت، ارائهٔ چه مدارکی لازم است؟',
      description: '\n' +
        '    • شرح دقیق حادثه\n' +
        '    • دستگاه معیوب به همراه جعبه\n' +
        '    • اصل کارت گارانتی (در صورت وجود)\n' +
        '    • لوازم جانبی مانند شارژر'
    },
    {
      id: 13,
      title: 'نحوهٔ ارائهٔ مدارک برای دریافت خسارت چگونه است؟',
      description: 'تمامی مدارک از طریق بارگذاری در پنل کاربری به‌صورت آنلاین ارائه می‌شوند.'
    },
    {
      id: 14,
      title: 'آیا تمامی هزینه‌های خسارت پرداخت می‌شود؟',
      description: 'در تمامی حوادث اعم از سرقت، آسیب فیزیکی یا از دست رفتن کامل دستگاه، فرانشیز ‌‌۲۰‌‌٪ لحاظ می‍‍‌‍‍شود.'
    },
    {
      id: 15,
      title: 'اگر ساکن تهران نباشم، چگونه دستگاه آسیب‌دیده را ارسال کنم؟',
      description: 'سرویس‌دهی بیمه تجهیزات الکترونیک دیجی‌پی در سراسر کشور فعال است و نیازی به ارسال دستگاه به تهران نیست.'
    },
    {
      id: 16,
      title: 'از کجا بفهمم وضعیت رسیدگی به خسارت در چه مرحله‌ای است؟',
      description: 'برای استعلام، با شماره 53924000-۰۲۱ داخلی ۵ تماس بگیرید.\n' +
        'در صورت موجود بودن قطعات، دستگاه در مدت ۴۸ ساعت کاری تعمیر می‌شود. در صورت نیاز به تأمین قطعه، زمان بیشتری لازم است. در صورت غیرقابل تعمیر بودن، خسارت نقدی واریز می‌شود.'
    },
    {
      id: 17,
      title: 'در چه صورت امکان دریافت خسارت وجود ندارد؟',
      description: 'در صورتی که عکس‍‍‍ها یا مدارک آپلودشده در مرحله خرید بیمه نامه، مخدوش یا غیرقابل تشخیص باشند، امکان‌‌ ' +
        'بررسی و پرداخت خسارت وجود نخواهد داشت. لطفاً از صحت و وضوح کامل تصاویر اطمینان حاصل کنید.'
    },
    {
      id: 18,
      title: 'اگر دستگاه قابل تعمیر نباشد، خدمات بیمه چگونه خواهد بود؟',
      description: 'میزان خسارت توسط واحد خسارت برآورد شده و تا سقف ارزش تعیین‌شده در بیمه‌نامه (با لحاظ فرانشیز و سایر شرایط) به حساب شما واریز می‌شود.'
    },
    {
      id: 19,
      title: 'با یک بیمه‌نامه چند بار می‌توانم اعلام خسارت کنم؟',
      description: 'اعلام خسارت تا سقف ارزش کالای بیمه‌شده ممکن است. اما برای هر قطعه از دستگاه فقط یک‌بار می‌توانید خسارت دریافت کنید.'
    },
    {
      id: 20,
      title: 'آیا می‌توانم برای یک مشکل مشخص چند بار خسارت بگیرم؟',
      description: 'خیر؛ برای هر مشکل و قطعه (مثلاً ترک خوردن صفحه‌نمایش) تنها یک‌بار در دورهٔ اعتبار بیمه‌نامه امکان دریافت خسارت وجود دارد.'
    },
    {
      id: 21,
      title: 'بعد از ثبت خسارت چه اقدامی باید انجام دهم؟',
      description: 'نیازی به اقدام خاصی نیست؛ کارشناسان بیمه برای هماهنگی‌های بعدی با شما تماس خواهند گرفت.'
    },
    {
      id: 22,
      title: 'بیمه نامه ام پرداخت شده، اما نمی‍‍‌‍‍توانم خسارت ثبت کنم؛ چرا؟',
      description: 'زیرا بیمه‌نامه هنوز فعال نشده است. پس از ثبت شماره سریال دستگاه (IMEI) در پنل کاربری، بیمه‌نامه فعال و امکان ثبت خسارت فراهم می‌شود.'
    },
    {
      id: 23,
      title: 'شرایط و نحوهٔ تعمیرات و خدمات به چه صورت است؟',
      description: 'تعمیر دستگاه توسط متخصصان دیجی‌کالا سرویس انجام می‌شود. هر تعمیر ۳ ماه و هر قطعهٔ تعمیرشده ۶ ماه گارانتی دارد.'
    },
    {
      id: 24,
      title: 'مشکل یا سؤال خود را در موارد بالا پیدا نکردم',
      description: 'برای دریافت پاسخ سؤالات و رفع مشکلات، می‌توانید در تمام روزهای هفته با شماره 53924000-۰۲۱ داخلی ۵ تماس بگیرید.'
    },
  ],
  [FaqCategoryTypeEnum.HOUSE_INCIDENTS]: [
    {
      id: 0,
      title: 'بیمه‌ٔ خانه دیجی‌پی چیست؟',
      description: 'بیمه‌ٔ خانه دیجی‌پی نوعی بیمه‌ٔ آتش‌سوزی و حوادث منازل مسکونی است که برخی از پوشش‌های اضافی را به‌صورت پیش‌فرض ارائه می‌دهد. مهم‌ترین تفاوت این بیمه با طرح‌های مشابه، پوشش خسارت‌های ناشی از جنگ و بمباران است.'
    },
    {
      id: 1,
      title: 'بیمه‌ٔ آتش‌سوزی و حوادث منازل مسکونی چیست؟',
      description: 'این بیمه، خسارت‌های مالی ناشی از آتش‌سوزی، صاعقه و انفجار وارد بر اموال و دارایی‌های منقول یا غیرمنقول بیمه‌گذار (خریدار بیمه) را جبران می‌کند.'
    },
    {
      id: 2,
      title: 'چه خطراتی تحت پوشش این بیمه قرار دارند؟',
      description: 'آتش‌سوزی، صاعقه، انفجار، زلزله و آتشفشان، سیل و طغیان آب، ترکیدگی لوله‌های آب، خسارت ناشی از ذوب برف و باران، طوفان و تندباد، سقوط هواپیما، نشت و رانش زمین، برخورد جسم خارجی، انفجار یا دفرمه شدن ظروف تحت فشار صنعتی، شکست شیشه، سرقت با شکست حرز، هزینه‌های پاک‌سازی و برداشت ضایعات، شورش و بلوا، جنگ و بمباران.'
    },
    {
      id: 3,
      title: 'آیا برای صدور بیمه‌نامه نیاز به بازدید اولیه وجود دارد؟',
      description: 'خیر، در طرح‌های ارائه‌شده توسط دیجی‌پی، نیازی به بازدید اولیه نیست.'
    }, {
      id: 4,
      title: 'آیا این بیمه خسارت واردشده به همسایگان را نیز پوشش می‌دهد؟',
      description: 'بله، در طرح‌های ارائه‌شده توسط دیجی‌پی، این مورد تحت پوشش قرار دارد.'
    }, {
      id: 5,
      title: 'مدت اعتبار بیمه‌نامه آتش‌سوزی چقدر است؟',
      description: 'مدت اعتبار بیمه‌نامه یک‌ساله است.'
    }, {
      id: 6,
      title: 'چه اموالی تحت پوشش این بیمه قرار نمی‌گیرند؟',
      description: 'جواهرات، مسکوکات، پول نقد، اوراق بهادار، نسخ خطی، دفاتر بازرگانی و اسناد از جمله استثنائات این بیمه‌نامه هستند و تحت پوشش قرار نمی‌گیرند.'
    }, {
      id: 7,
      title: 'در صورت بروز خسارت، چه اقداماتی باید انجام داد؟',
      description: 'بیمه‌گذار باید در اولین فرصت، حداکثر ظرف ۵ روز از زمان اطلاع از حادثه، موضوع را به‌صورت شفاهی، کتبی یا تلفنی به بیمه‌گر اطلاع دهد. همچنین تا زمان بازدید کارشناسان، نباید تغییری در محل ایجاد شود، مگر در مواردی که برای جلوگیری از گسترش خسارت ضروری باشد.'
    }, {
      id: 8,
      title: 'آیا در صورت افزایش ارزش مورد بیمه به‌دلیل تورم، خسارت به قیمت روز پرداخت می‌شود؟',
      description: 'خیر، حداکثر تعهد بیمه‌گر برابر با سرمایه مندرج در بیمه‌نامه است. در صورت افزایش ارزش مورد بیمه، بیمه‌گذار باید موضوع را کتبی به بیمه‌گر اعلام کند تا با صدور الحاقیه و پرداخت حق بیمهٔ اضافی، پوشش به‌روزرسانی شود. در غیر این‌صورت، خسارت به نسبت سرمایه بیمه‌شده پرداخت می‌گردد (قاعدهٔ نسبی سرمایه).'
    }, {
      id: 9,
      title: 'در صورت ایجاد تغییراتی در طول مدت بیمه‌نامه، مانند افزایش یا کاهش سرمایه، چه باید کرد؟',
      description: 'بیمه‌گذار موظف است تغییرات ایجادشده را کتبی به بیمه‌گر اعلام کند. پس از بررسی، بیمه‌گر تغییرات را از طریق صدور الحاقیه در بیمه‌نامه اعمال خواهد کرد.'
    },
  ]
};
