export const SWIPER_ITEM_DATA = {
  buyList: [
    {
      iconName: 'buy-digikala',
      title: 'خرید محصول از دیجیکالا',
      description: 'وارد سایت دیجی‌کالا شده و گوشی تلفن مورد نظر خود را از سایت دیجیکالا خریداری کنید. ',
    },
    {
      iconName: 'buy-chain',
      title: 'دریافت لینک بیمه تجهیرات',
      description: 'پس از خرید گوشی تلفن از سایت دیجیکالا٬ پیامک حاوی لینک بیمه تجهیزات دیجی پی برای شما ارسال میشود. از طریق لینک موجود در پیامک وارد پرسه خرید بیمه میشوید.',
    },
    {
      iconName: 'buy-check',
      title: 'چک کردن محصول',
      description: 'در صفحه باز شده شما میتوانید اطلاعات موجود در مورد محصول خریداری شده خود را بررسی کنید',
    },
    {
      iconName: 'buy-card',
      title: 'خرید بیمه',
      description: 'در این مرحه شما پس از بررسی قیمت و اطلاعات دیگر میتوانید خرید بیمه تجهیزات خود را ثبت کنید.',
    }
  ],
  declareClaimList: [
    {
      iconName: 'declare-note',
      title: 'ثبت و اعلام خسارت',
      description: 'فرم های مربوط به اعلام خسارت و جزییات نحوه آسیب دیدگی را تکمیل کنید.',
    },
    {
      iconName: 'declare-break',
      title: 'ارزیابی خسارت',
      description: 'همکاران ما درخواست شما را بررسی کرده و پس از تایید به شما اطلاع میدهند.',
    },
    {
      iconName: 'declare-repair',
      title: 'تعمیر یا پرداخت خسارت',
      description: 'همکاران ما کالای آسیب دیده را از شما تحویل میگیرند و بدون کمترین هزینه ای آنرا تعمیر یا تعویض میکنند.',
    }
  ],
  TransferList: [
    {
      iconName: 'declare-note',
      title: 'وارد کردن اطلاعات بیمه نامه',
      description: 'اطلاعات مربوط به بیمه نامه خود را وارد کنید',
    },
    {
      iconName: 'transfer-person',
      title: 'وارد کردن اطلاعات مالک جدید',
      description: 'اطلاعات مربوط به مالک جدید را وارد کنید',
    },
    {
      iconName: 'transfer',
      title: 'تایید و انتقال',
      description: 'اطلاعات نهایی را به دقت بررسی کنید و سپس آن را تایید کنید.',
    }
  ]
};
