export const terms: Array<{ title: string; tips: string[] }> = [
  {
    title: 'ماده یک (1): تعاریف',
    tips: [
      '	دیجی‌کارت: کارت بانکی صادرشده توسط دیجی‌پی  با همکاری بانک شهر جهت خرید حضوری از طریق کیف‌پول نقدی کاربر  بر روی دستگاه‌های پوز.',
      '	کاربر: شخص حقیقی یا حقوقی دارنده حساب کاربری دیجی‌پی که درخواست صدور کارت داده است.',
      '	کیف‌پول (والت) دیجی‌پی: حساب کاربری کاربر برای نگهداری موجودی نقدی کاربران. ',
      '	پذیرنده: فروشگاه‌های متصل به دستگاه پوز در سراسر کشور',
    ],
  },
  {
    title: 'ماده دو (۲): مواد عمومی',
    tips: [
      '	کاربر اعلام و اقرار می‌نماید که شرایط عمومی استفاده از خدمات دیجی‌پی را مطالعه و نسبت به شرایط و مفاد آن اطلاع کامل داشته و عمل به شرایط مقرر در سند مذکور را پذیرفته است.',
      '	به ازای هر کدملی صرفاً یک دیجی‌کارت صادر می‌شود، لذا امکان تخصیص بیش از یک کارت به کاربر وجود ندارد، اما کاربر در صورت تمایل می‌تواند از طریق سوپراپلیکیشن دیجی‌پی، نسبت به اتصال کارت به حساب کاربری دیگر خود و جداسازی کارت از حساب فعلی خویش، اقدام نماید.',
      '	کارت‌های دیجی‌پی با پشتوانه و همکاری بانک‌های طرف قرارداد با دیجی‌پی و به صورت متصل به شبکه شتاب صادر می‌شوند، لذا مشمول کلیه قوانین و مقررات لازم الأجرای مرتبط از جمله مصوبات بانک مرکزی، بانک صادرکننده کارت و همچنین دستورالعمل‌های شاپرک در حوزه پرداخت و حقوق و محدودیت‌های مترتب بر آن است.',
    ],
  },
  {
    title: 'ماده سه (3): شرایط صدور',
    tips: [
      'صدور کارت تنها برای کاربران دارای حساب کاربری فعال و معتبر در دیجی‌پی با شماره ملی و شماره تلفن همراه متناظر امکان‌پذیر است. لذا شماره موبایل اعلامی در حساب کاربری باید الزاماً متعلق به شماره ملی ثبت شده در حساب کاربری باشد.',
      'ثبت اطلاعات هویتی (کد ملی، تاریخ تولد و ...) و تأیید آن توسط سرویس‌های استعلامی رسمی الزامی است.',
      'دیجی‌کارت به حساب کاربری کاربر در دیجی‌پی متصل است، لکن کاربر می‌تواند در صورت تمایل، از طریق اپلیکیشن دیجی‌پی نسبت به انتقال موجودی نقدی کیف‌پول خود به کیف‌پول نقدی سایر کاربران  اقدام نماید.',
      'امکان تغییر مشخصات فردی و کدملی کاربر پس از تعریف کاربر و صدور کارت وجود ندارد. لذا در صورت انتقال سیمکارت یا تلفن به ثالث یا موارد عدم دسترسی کاربر به سیمکارت یا تمایل به تغییر شماره تماس، کاربر می‌تواند از طریق راه‌های ارتباطی مندرج در سایت و اپلیکیشن دیجی‌پی، با پشتیبانی دیجی‌پی تماس حاصل نماید. لذا در صورتی که کاربر پیش از خرج نمودن یا انتقال موجودی نقد دیجی‌کارت نسبت به انتقال سیمکارت اقدام نماید، کلیه مسئولیت‌ها یا سوءاستفاده‌‌های احتمالی متوجه کاربر است.',
    ],
  },
  {
    title: 'ماده چهارم (4):  نحوه استفاده',
    tips: [
      'موجودی نقد موجود در دیجی‌کارت در تمامی فروشگاه‌های حضوری با دستگاه پوز متصل به شبکه شتاب قابل استفاده است.',
      'کاربر عالم و آگاه است که باید هزینه‌کرد کارت دیجی‌پی خود را صرفاً از طریق فروشگاه‌های حضوری دارای مجوز از مراجع صالح قانونی انجام دهد و قوانین و مقررات و نظامات را محترم بشمارد. لذا کاربر حق خرج‌پذیری کارت دیجی‌پی را در فروشگاه‌های حضوری غیرمجاز یا مصرف آن در خصوص فعالیت‌های غیرمجاز و غیرقانونی از قبیل قمار، شرط بندی، قاچاق کالا و ارز، خرید و فروش دخانیات و مواد مخدر و مواردی از این قبیل ندارد. بدیهی است در صورت اطلاع دیجی‌پی از هر طریق ممکن در خصوص تخلف کاربر، دیجی‌پی مجاز به محدود و یا مسدودسازی ارائه خدمات به کاربر است.',
      'دیجی‌پی مسئولیتی در خصوص رعایت قوانین و مقررات از قبیل کیفیت کالا و خدمات ارائه شده و همچنین تضمینی در خصوص تحویل کالا و خدمات توسط اشخاص ثالث (پذیرندگان و فروشگاه‌های خارج از شبکه پذیرندگی دیجی‌پی) ندارد. لذا دیجی‌پی هیچ‌گونه مسئولیتی در خصوص جبران خسارت‌های وارده به کاربر یا پیگیری اختلافات کاربر با فروشگاه ندارد و کلیه مسئولیت‌های مرتبط و متصور در این خصوص، متوجه کاربر است.',
      'درحال حاضر کاربر صرفاً امکان خرج‌پذیری وجه نقد شارژ شده در کارت دیجی‌پی را دارد. لذا کاربر عالم و آگاه است که امکان استفاده و خرج‌پذیری بخش اعتباری کیف‌پول دیجی‌پی کاربر و همچنین وام بانکی دریافتی از طریق دیجی‌پی در دیجی‌پی کارت وجود ندارد.',
      'لازم است کاربر در زمان خرید کالا یا خدمات، به اندازه مبلغ دریافت کالا یا خدمت، موجودی نقد دیجی‌کارت داشته باشد. بنابراین کاربر نمی‌تواند بخشی از مبلغ کالا یا خدمت را از طریق دیجی‌کارت و مابقی را از طریق اعتبار دیجی‌پی یا تسهیلات دریافت شده از طریق دیجی‌پی پرداخت نماید. لکن کاربر می‌تواند در خریدهای حضوری تا سقف میزان مبلغ خرید را از موجودی کیف‌پول الکترونیک خرید نماید و مازاد مبلغ را به‌وسیله کارتی دیگر یا به صورت نقدی پرداخت نماید. ',
      'کاربر در صورت تمایل به دسترسی به تراکنش‌های صورت پذیرفته شده از طریق دیجی‌کارت، امکان مشاهده تراکنش‌های خود را از طریق پنل کاربری خود در اپلیکیشن دیجی‌پی دارد.',
      'کاربر عالم و آگاه است که دریافت دیجی‌کارت مستلزم دریافت یکی از اشتراک‌‌‌های مختص دیجی‌کارت از قبیل Pay Pro وPay Plus  در اپلیکیشن دیجی‌پی است. لذا به صرف عضویت کاربر در دیجی‌پی یا حتی خرید اشتراک‌های مندرج در اپلیکیشن دیجی‌پی‌ (از قبیل تیتانیوم، الماس، برلیان، پلاتینیوم، طلایی، نقره‌ای و برنزی) نیز به منزله امکان دریافت دیجی‌کارت نیست. همچنین کاربر مکلف است پیش از درخواست دریافت کارت، به دقت هزینه‌های مرتبط را مطالعه نمایند و در صورت تمایل به دریافت کارت، هزینه‌های اعلامی را پرداخت نماید',
    ],
  },
  {
    title: 'ماده پنج (5): مسئولیت‌های کاربر',
    tips: [
      'کاربر موظف به حفظ و نگهداری کارت و رمز آن است. لذا در صورت اهمال کاربر در حفاظت از کارت، مفقودی یا هرگونه سوء استفاده ازکارت، مسئولیت‌های حقوقی و احتمالی آن متوجه کاربر است.',
      'هر تراکنش انجام‌شده با رمز صحیح، معتبر تلقی می‌شود. لذا به کاربران توصیه اکید می‌شود در حفظ و نگهداری رمز عبور خود کوشا باشند و این رمز را در اختیار هیچ‌کس از جمله متصدی فروش یا پذیرنده قرار ندهند.',
      'در صورت مفقودی یا سرقت کارت، کاربر باید بلافاصله از طریق اپلیکیشن یا تماس با پشتیبانی اقدام به مسدودسازی دیجی‌کارت نماید. بدیهی است در صورت تماس تلفنی کاربر با پشتیبانی، مسدودسازی کارت مستلزم احراز هویت کاربر توسط همکاران پشتیبانی دیجی‌پی پیش از مسدودسازی است.',
      'دیجی‌پی هیچ مسئولیتی در قبال خسارات ناشی از اهمال کاربر در اطلاع‌رسانی به‌موقع مفقودی یا سرقت کارت ندارد.',
      'در خریدهای حضوری لازم است از رمز اول کارت استفاده شود.',
    ],
  },
  {
    title: 'ماده شش (6): محدودیت‌ها',
    tips: [
      'استفاده از کارت در تراکنش‌های غیرقانونی مطابق دستورالعمل شاپرک (شامل و نه محدود به پولشویی، قمار، خرید ارز دیجیتال و ...) ممنوع است. لذا در صورت تخطی کاربر یا دارنده کارت از الزامات قانونی، مسئولیتی متوجه دیجی‌پی نیست.',
      'در صورت مشاهده موارد ناقض قوانین و مقررات الزام آور به تشخیص دیجی‌پی و یا حسب اعلام مراجع ذیصلاح قانونی، دیجی‌پی مجاز است به تشخیص خود نسبت به محدود یا مسدودسازی حساب کاربر تا زمان تعیین تکلیف اقدامات کاربر نزد مرجع اعلام تخلف یا رفع ابهام از فعالیت‌های کاربر، اقدام نماید.',
      'سقف تراکنش و مصرف کیف‌پول نقدی دیجی پی بر اساس ضوابط دیجی‌پی و بانک مرکزی تعیین می‌شود.',
      'کالا یا خدمات دریافت شده با دیجی‌کارت در خریدهای حضوری فاقد امکان بازگشت وجه (Refund) هستند. همچنین در خریدهای حضوری به‌جز در موارد پیش‌بینی‌شده از سوی دیجی‌پی که تنها خطاهای سیستمی می‌باشد،  بازگشت وجه امکان‌پذیر نیست. در این مفاد بند حاضر تفکیکی میان فروشگاه‌ها و پذیرندگان طرف قرارداد با دیجی‌پی و سایر فروشگاه‌ها وجود ندارد.',
      'کاربر امکان دریافت و خرید هم‌زمان اشتراک مختص دیجی‌کارت و اشتراک اپلیکیشن دیجی‌پی را ندارد. لذا در صورت تمایل به دریافت اشتراک دیگر و استفاده از خدمات و امتیازات نوع دیگری از اشتراک، مکلف به لغو اشتراک فعلی از طریق اپلیکیشن و سپس خرید نوع دیگری از اشتراک است. لذا دیجی‌پی هیچ مسئولیتی در خصوص عودت اشتراک لغو شده به درخواست کاربر ندارد.',
    ],
  },
  {
    title: 'ماده هفت (7): خدمات و پشتیبانی',
    tips: [
      'دیجی‌پی متعهد به ارائه خدمات پشتیبانی در خصوص صدور، چاپ، ارسال و مدیریت کارت از طریق راه‌های ارتباطی مندرج در سایت و اپلیکیشن دیجی‌پی است.',
      'دیجی‌پی تمام تلاش خود را جهت ارسال هرچه سریع‌تر کارت‌ها صورت می‌دهد، در عین حال کاربر آگاه است که چاپ و ارسال کارت از زمان درخواست کاربر ممکن است بین ۷ تا ۱۰ روز کاری طول بکشد.',
      'تأخیرهای ناشی از پیمانکاران چاپ یا ارسال کارت در تعهد مستقیم دیجی‌پی نیست؛ اما دیجی‌پی خود را موظف به پیگیری می‌داند.',
      'دیجی‌پی، کارت کاربر را به وسیله پست به صورت رایگان ارسال می‌نماید. لکن در صورت عدم حضور یا تحویل نگرفتن کارت توسط کاربر کارت به پست محل جغرافیایی کاربر ارسال می‌شود و تا ۵ روز در باجه معطله پست باقی می‌ماند. کاربر می‌تواند با مراجعه به پست و اعلام کدرهگیری کارت خود را تحویل بگیرد. پس از سپری شدن مدت زمان مذکور کارت به دیجی‌پی بازگردانده می‌شود. ارسال مجدد کارت مستلزم پرداخت هزینه ارسال است که بسته به عواملی از هزینه‌های پستی توسط دیجی‌پی محاسبه و در هنگام درخواست به کاربر اعلام می‌گردد.',
      'کاربر دارنده کارت دیجی‌پی می‌تواند از طریق بخش مدیریت کارت در اپلیکیشن نسبت به مشاهده تاریخ انقضا و شماره کارت (با محوشدگی اعدات وسط شماره کارت) دیجی‌پی کارت خود اقدام نماید. ',
    ],
  },
  {
    title: 'ماده هشت (8): قوانین حاکم',
    tips: [
      'سند حاضر تابع قوانین و مقررات جمهوری اسلامی ایران است.',
      'طرفین شهر تهران را به عنوان محل انعقاد و پذیرش مفاد سند حاضر انتخاب و محاکم قضایی شهر تهران را به‌عنوان مرجع حل اختلافات احتمالی در خصوص سند حاضر مورد پذیرش قرار دادند.',
    ],
  },
  {
    title: 'ماده نه (9): مواد و دامنه اعمال سند',
    tips: [
      'این سند در ۹ ماده تنظیم و مورد تأیید کاربر قرار گرفته و دیجی‌پی مختار است در هر زمان نسبت به اصلاح، تغییر و به‌روز رسانی آن اقدام نماید، لکن تکلیفی به اطلاع رسانی تغییرات انجام شده به کاربر نداشته و تداوم استفاده کاربر از خدمات کارت دیجی‌پی به منزله پذیرش آن است. همچنین کاربر با استفاده از این خدمات و استفاده از آن، پذیرفته است که شرایط عمومی و اختصاصی اپلیکیشن دیجی‌پی را نیز مطالعه و پذیرفته است و آن شرایط نیز علاوه بر سند حاضر مورد پذیرش کاربر است.',
    ],
  },
  {
    title: 'ماده ده (10): قوانین و مقررات خرید اشتراک',
    tips: [
      'درصورت لغو اشتراک، دسترسی شما به اشتراک فعلی قطع می‌شود و دیگر قادر به استفاده از خدمات قابل استفاده نخواهید بود.',
      'این اشتراک پس از 1ماه، به صورت خودکار غیرفعال می‌شود.',
    ],
  },
];
