import { ChangeDetectionStrategy, Component, inject, signal } from '@angular/core';
import { CommonModule, Location } from '@angular/common';
import { NgxAppBarComponent } from '@digipay/ngx-app-bar';

@Component({
  selector: 'wealth-applet-terms-and-conditions',
  standalone: true,
  imports: [CommonModule, NgxAppBarComponent],
  templateUrl: './terms-and-conditions.component.html',
  styleUrl: './terms-and-conditions.component.scss',
  changeDetection: ChangeDetectionStrategy.OnPush,
})
export class TermsAndConditionsComponent {
  private location = inject(Location);

  terms = signal<ITermsAndConditionsComponent | undefined>({
    title: `قوانین و مقررات استفاده از خدمات مدیریت ثروت دیجی‌پی`,
    value: [
      `از کاربران گرامی درخواست می‌شود پیش از استفاده از خدمات مدیریت ثروت در سایت و اپلیکیشن دیجی‌پی، نسبت به مطالعه متن حاضر اقدام نمایند.
متن حاضر به‌عنوان قرارداد قوانین و مقررات استفاده از خدمات مدیریت ثروت دیجی‌پی تلقی گردیده و به منزله قراردادی الزام آور میان استفاده کنندگان سایت و اپلیکیشن دیجی‌پی که در این سند «کاربر» نامیده می‌شوند از یک سو و شرکت نوآوران پرداخت مالی ایرانیان (با نام و علامت تجاری دیجی‌پی) به شناسه ملی 14007678524 و شماره ثبت 527803 که در این سند «دیجی‌پی» و «شرکت» نامیده می‌شود، است.
`,
    ],
    items: [
      {
        title: `فصل اول: حقوق و تعهدات کاربر`,
        value: [
          `1-\tکاربر اعلان و اقرار می‌نماید که شرایط عمومی استفاده از خدمات دیجی‌پی و شرایط جامع استفاده از خدمات دیجی‌پی را مطالعه نموده و ضمن پذیرش شرایط مذکور، سند حاضر را نیز مطالعه و مفاد آن از جمله الزام آور بودن آن فی‌مابین کاربر و دیجی‌پی را مطالعه و پذیرفته است.`,
          `2-\tکاربر نسبت به صحت اطلاعات وارد شده از قبیل نام و نام خانوادگی، شماره تماس و پست الکترونیک، شماره حساب و سایر مدارک ابرازی خود اطمینان کامل داشته و هرگونه دسترسی غیرمجاز به حساب کاربری خود ناشی از مواردی که متوجه دیجی‌پی نیست نظیر ورود غیرمجاز اشخاص دیگر، دسترسی به تلفن همراه کاربر توسط ثالث و مواردی از این قبیل، هیچ ارتباطی با دیجی‌پی نداشته و مسئولیتی از این بابت متوجه شرکت نیست.`,
          `3-\tاستفاده از سرویس‌های مدیریت ثروت دیجی‌پی صرفاً برای افراد بالای 18 سال تمام خورشیدی مجاز است. لذا فعالیت کاربر در بخش مدیریت ثروت به منزله اعلان و اقرار به دارا بودن حداقل 18 سال تمام خورشیدی است و مسئولیت‌های احتمالی احراز عدم صحت اطلاعات بر عهده کاربر است.`,
          `4-\tدیجی‌پی صرفاً با برخی از ابزارهای مدیریت ثروت از جمله در حوزه صندوق‌های سرمایه‌گذاری، سکوهای تأمین مالی جمعی، بانک‌ها و موسسات اعتباری، شرکت‌های بیمه و پلتفرم‌های سرمایه‌گذاری طلا طرف قرارداد است و به ارائه سرویس‌های سرمایه‌گذاری در این حوزه‌ها در پلتفرم خود می‌پردازد. لذا کاربر آگاه است که لزوماً همه ابزارهای مدیریت ثروت در دیجی‌پی فعال نیستند. از سویی ممکن است تعداد این ارائه دهندگان خدمات سرمایه‌گذاری بسته به قراردادهای آتی یا تغییر وضعیت قراردادهای فعلی کم یا زیاد گردد. لذا دیجی‌پی مسئولیت و تعهدی در تداوم حضور صندوق‌ها و سایر ابزارهای سرمایه گذاری در بستر پلتفرم خویش ندارد و در نتیجه در صورت حذف یک یا چند صندوق یا ارائه دهنده خدمات سرمایه‌گذاری از فهرست ارائه دهندگان خدمات نمایه شده در دیجی‌پی، کاربر می‌تواند ادامه فعالیت خود در آن سرویس خاص را از طرق دیگر نظیر سایت اختصاصی سرویس دهنده، پیگیری نماید.`,
          `5-\tتعیین میزان سود و بازه زمانی تقسیم سود هریک از ارائه دهندگان خدمات سرمایه گذاری توسط هر ارائه دهنده خدمت تعیین می‌شود و دیجی‌پی دخالتی در تعیین این موارد ندارد. لذا کاربر مکلف است در زمان خرید از هریک از ارائه دهندگان خدمات فوق الذکر، این موارد را بررسی نماید و مسئولیتی در این خصوص متوجه دیجی‌پی نیست.`,
          `6-\tکاربر به دیجی‌پی اجازه بی قید و شرط می‌دهد که در صورت وجود بدهی پرداخت نشده سررسید شده کاربر در دیگر سرویس‌های دیجی‌پی (شامل و نه محدود به سرویس خرید قسطی الان بخر بعداً پرداخت کن (BNPL)، خدمات بیمه، تسهیلات بانکی با ضمانت دیجی‌پی، خرید چکی و سایر خدمات ارائه شده در سایت و اپلیکیشن دیجی‌پی)، نسبت به مسدودسازی، توقیف دارایی کاربر به میزان تعهدات وی نزد ارائه دهندگان خدمات سرمایه‌گذاری طرف قرارداد با دیجی‌پی و حسب مورد برداشت از آنها اقدام نماید و حق هرگونه طرح دعوی و اعتراض در مراجع قضایی، اداری، صنفی و مانند آن در گذشته، حال و آینده را در خصوص این بند از خود سلب و ساقط نموده و به دیجی‌پی صلح نموده. در همین راستا کاربر به دیجی‌پی، وکالت تام الاختیار در توقیف، فروش اموال و اجازه برداشت از دارایی و وجوه حاصل از فروش آنها ولو به خود را اعطا نمود.`,
          `7-\tکاربر مکلف است اطلاعات هویتی اعلامی در زمان ثبت نام در سرویس مدیریت ثروت دیجی‌پی را به صورت کامل تکمیل نماید و استعلام‌ها و اقدامات لازم از قبیل و نه محدود به ثبت نام در سامانه سجام و اخذ کد پیگیری سجام که در مرحله ثبت‌نام و خرید به کاربر نمایش داده می‌شود را انجام دهد. بدیهی است در صورت عدم تکمیل هریک از مواردی که تکمیل آن الزمی است، ممکن است ثبت‌ نام کاربر ناقص تلقی شده و امکان خرید برای وی فراهم نگردد. لذا کاربر حق هیچ‌گونه اعتراضی در این خصوص ندارد.`,
          `8-\tبه منظور احراز هویت کاربران، هر کاربر مکلف به اعلام و درج شماره‌ حسابی در بخش حساب کاربری خود در سرویس مدیریت ثروت دیجی‌پی است که متعلق به خود او است. بنابراین در صورت عدم تطابق شماره کارت، شماره تلفن همراه و شماره ملی کاربر، دیجی‌پی اجازه دارد نسبت به مسدودسازی واحدهای سرمایه‌گذاری در حساب کاربر تا زمان رفع نقص توسط کاربر اقدام نماید.`,
        ],
      },
      {
        title: `فصل دوم: حقوق و تکالیف دیجی‌پی`,
        value: [
          `9-\tدیجی‌پی صندوق مدیریت ثروت یا ارائه دهنده خدمات سرمایه‌گذاری نیست و با دریافت مجوزهای از مراجع صلاحیت‌دار قانونی همکاری می‌کند. مرجع نظارتی این حوزه‌ نیز نهادهای ذیصلاح قانونی از جمله سازمان بورس اوراق بهادار هستند. لذا با توجه به اینکه دیجی‌پی صرفا یک سکوی ارتباطی بین کاربر و ارائه دهندگان خدمات سرمایه گذاری می‌باشد، دیجی‌پی مسئولیتی در خصوص نقض تعهدات قراردادی و قانونی توسط ارائه دهنده خدمات سرمایه گذاری ندارد. علی‌ایحال در خصوص عدم تعهد و پایبندی ارائه دهندگان این خدمات به قوانین و مقررات، کاربر می‌تواند برای پیگیری ادعای خویش به مراجع نظارتی قانونی مراجعه نماید و تکلیفی از این باب متوجه دیجی‌پی نیست.`,
          `10-\tدیجی‌پی همواره در تلاش است تا در محدوده قرارداد خود با صندوق‌ها، ارائه دهندگان خدمات سرمایه گذاری و سایر نهادهای مالی و قوانین و مقررات موجود نسبت به رعایت قوانین و مقررات و حقوق کاربر توسط طرف مقابل نظارت داشته باشد و در صورت مشاهده تخلف از سوی طرف مقابل که منجر به ورود لطمه مالی یا اعتباری به دیجی‌پی یا لطمه مالی به کاربر گردد، حسب مورد نسبت به انجام اقدامات مقتضی برای حراست از حقوق خود و کاربران اقدام نماید. لیکن این تعهد به وسیله بوده و دیجی‌پی مسئولیتی در قبال کاربران نخواهد داشت.`,
          `11-\tپرداخت در سامانه مدیریت ثروت دیجی‌پی و همچنین ارائه دهندگان خدمات سرمایه گذاری نمایه شده در آن، توسط درگاه‌های پرداخت صورت می‌گیرد. لذا در صورت عدم موفقیت تراکنش و پرداخت کاربر، مسئولیت بازگشت وجه به حساب درج شده در حساب کاربری بر عهده درگاه پرداخت و بانک عامل مرتبط با آن و ذیل قوانین درگاه پرداخت است.`,
          `12-\tکاربران سرویس‌های مدیریت ثروت دیجی‌پی موظف به رعایت قوانین جمهوری اسلامی ایران هستند. در صورت مشاهده نقض یا تخطی از قوانین لازم الاجرای کشور یا دستور مراجع قضایی یا نظارتی، دیجی‌پی مختار است نسبت به محدود یا مسدودسازی حساب کاربری کاربر اقدام نماید.`,
          `13-\tدیجی‌پی با هدف حراست از حقوق خود و کاربران، محق است در هر زمان نسبت به تغییر هر یک از ارائه دهندگان خدمات سرمایه گذاری (کارگزاری، سکوی تامین مالی جمعی و ...) اقدام نماید و ادامه استفاده کاربران از سرویس‌های مدیریت ثروت، به منزله موافقت ایشان با ثبت نام کاربر در سرویس دهنده منتخب دیجی‌پی است.`,
        ],
      },
      {
        title: `فصل سوم: مقررات خرید عرضه اولیه به صورت اعتباری`,
        value: [
          `14-\tدرخواست‌های کاربران از نوع درخواست خرید در سقف قیمت و با حداکثر سهمیه مجاز بر اساس اعتبار اعطایی توسط کارگزاری ارسال خواهد شد.`,
          `15-\tبا عنایت به فرآیند‌های سیستمی و نرم‌افزاری، اخذ درخواست مشارکت در عرضه اولیه و ارسال این درخواست‌ها به کارگزاری به منزله ثبت نهایی سفارش شما نبوده و در صورت بروز هرگونه مشکل در فرآیند مذکور، دیجی‌پی مسئولیتی در این خصوص نخواهد داشت.در نظر داشته باشید، در صورت انتخاب روش «سرمایه‌گذاری با اعتبار کارگزاری» ، سهام تخصیص داده شده به شما در عرضه اولیه پس از گذشت 5 روز کاری به صورت خودکار توسط کارگزاری به فروش رسیده و اصل اعتبار تخصیص یافته به شما از مبلغ فروش کسر می گردد. مابه‌التفاوت ناشی از سود احتمالی عرضه اولیه به کیف پول ETF شما واریز خواهد شد.`,
          `16-\tبازگشایی نماد عرضه اولیه و ایجاد قابلیت فروش، بسته به نوع عرضه اولیه و پس از طی مراحل قانونی و صدور مجوزهای لازم از سمت بورس انجام خواهد شد، و تا قبل از طی مراحل مذکور امکان فروش سهام خریداری شده و دسترسی به مبالغ حاصل از فروش برای کاربر فراهم نخواهد بود.`,
          `17-\tدر صورتی که بخواهید پس از گذشت 5 روز کاری از عرضه اولیه، کارگزاری نسبت به فروش سهام شما اقدام ننماید، می‌باست پیش از آغاز پنجمین روز کاری پس از روز عرضه، مقدار بدهی خود به کارگزاری (اعتبار اعطایی به شما) تسویه گردد. بدین منظور می‌توانید از طریق منوی "جزیئات دارایی" نسبت به مشاهده مقدار اعتبار استفاده شده از کارگزاری اقدام و سپس از طریق "شارژ کیف پول" بدهی خود را تسویه نمایید. در این صورت کارگزاری به صورت خودکار نسبت به فروش سهام شما اقدامی نخواهد کرد. بدیهی است در این حالت مسئولیت هرگونه سود یا زیان کاربر ناشی از تغییرات قیمت سهم بر عهده کاربر خواهد بود.`,
          `18-\tسرویس مدیریت ثروت دیجی‌پی هیچ‌گونه توصیه‌ای مبنی بر تشویق به مشارکت یا عدم مشارکت در این عرضه‌ها نداشته و تنها بستر مناسب جهت ارسال درخواست‌های کاربران به کارگزاری را فراهم می‌نماید.`,
          `19-\tدر نظر داشته باشید از زمان ثبت درخواست مشارکت در عرضه اولیه تا زمان نهایی شدن درخواست در روز عرضه، وضعیت سفارش به صورت " ثبت درخواست " قابل مشاهده خواهد بود. پس از انجام عرضه، وضعیت "تأیید" یا "رد سیستم" نمایش داده خواهد شد.`,
          `20-\tچنانچه کاربر همزمان با سرویس مدیریت ثروت دیجی پی، از طریق سایر روش‌ها و کارگزاری‌ها نسبت به ثبت درخواست عرضه اولیه اقدام نماید، تنها یکی از درخواست های وی به‌صورت تصادفی و مطابق رویه‌های سازمان بورس، شرکت‌های بورس و شرکت سپرده‌گذاری مرکزی اوراق بهادار انجام خواهد شد.`,
          `21-\tاعتبار تخصیصی به کاربران برای مشارکت در عرضه اولیه، مستقل از اعتبار کاربران در دیجی‌پی بوده و قوانین و مقررات مربوط به دریافت اعتبار از شرکت های کارگزاری طرف قرارداد سرویس مدیریت ثروت، بر کاربران نافذ خواهد بود.`,
          `22-\tکاربران با پذیرش موارد فوق،مسئولیت کلیه ریسک‌های ناشی از ارسال درخواست عرضه اولیه را پذیرفته و آگاهی از کلیه موارد مربوطه از قبیل مستندات عرضه اولیه، ابلاغیه های سازمان بورس و شرکت های بورس و مستندات افشا شده در سامانه کدال را اذعان میدارد.`,
          `23-\tنقدشوندگی سهام تابع شرایط بازار سرمایه است و مسئولیتی از این حیث متوجه دیجی‌پی نیست.`,
          `24-\tپذیرش سند حاضر به منزله درخواست شما جهت اخذ اعتبار از شرکت کارگزاری جهت خرید عرضه اولیه و صدور مجوز به کارگزاری جهت فروش سهام خریداری شده 5 روز پس از عرضه اولیه در صورت عدم تسویه اعتبار است.`,
          `25-\tبا عنایت به فرآیند‌های سیستمی و نرم‌افزاری، اخذ درخواست مشارکت در عرضه اولیه و ارسال این درخواست‌ها به کارگزاری به منزله ثبت نهایی سفارش شما نبوده و در صورت بروز هرگونه مشکل در فرآیند مذکور، دیجی‌پی مسئولیتی در این خصوص نخواهد داشت.`,
          `26-\tمشارکت در عرضه اولیه، دارای ریسک‌های ذاتی سرمایه‌گذاری است و نوعی سرمایه‌گذاری بدون ریسک محسوب نمیگردد.`,
        ],
      },
      {
        title: `فصل چهارم: مقررات خرید عرضه اولیه به صورت نقدی`,
        value: [
          `27-\t درخواست شما در بازه زمانی اعلامی از سوی ناظر بازار، ارسال می‌شود. در صورت کافی نبودن قدرت خرید به هر دلیل، سفارش متناسب با میزان مانده در زمان عرضه ارسال می‌گردد. بنا بر این کاربر موظف است از کافی بودن قدرت خرید خود پیش از عرضه اطمینان حاصل نماید.`,
          `28-\tدرخواست‌های کاربران از نوع درخواست خرید در سقف قیمت و با حداکثر سهمیه مجاز کاربران متناسب با قدرت خرید کاربر ارسال خواهد شد.`,
          `29-\tبازگشایی نماد عرضه اولیه و ایجاد قابلیت فروش، بسته به نوع عرضه اولیه و پس از طی مراحل قانونی و صدور مجوزهای لازم از سمت بورس انجام خواهد شد، و تا قبل از طی مراحل مذکور امکان فروش سهام خریداری شده و دسترسی به مبالغ حاصل از فروش برای کاربر فراهم نخواهد بود.`,
          `30-\tمشارکت در عرضه اولیه، دارای ریسک‌های ذاتی سرمایه‌گذاری است و نوعی سرمایه‌گذاری بدون ریسک محسوب نمی‌گردد.`,
          `31-\tبا عنایت به فرآیند‌های سیستمی و نرم‌افزاری، اخذ درخواست مشارکت در عرضه اولیه و ارسال این درخواست‌ها به کارگزاری به منزله ثبت نهایی سفارش شما نبوده و در صورت بروز هرگونه مشکل در فرآیند مذکور، دیجی‌پی مسئولیتی در این خصوص نخواهد داشت.`,
          `32-\tسرویس مدیریت ثروت دیجی‌پی هیچ‌گونه توصیه‌ای مبنی بر تشویق به مشارکت یا عدم مشارکت در این عرضه‌ها نداشته و تنها بستر مناسب جهت ارسال درخواست‌های کاربران به کارگزاری را فراهم می‌نماید.`,
          `33-\tبا توجه به مشخص نبودن قیمت دقیق عرضه در برخی عرضه‌ها و یا مشخص نبودن مقدار دقیق قابل تخصیص در برخی دیگر، در نظر داشته باشید در صورتی که روش " سرمایه‌گذاری از طریق درگاه بانکی" را انتخاب نمایید، مبلغ اخذ شده از شما برآوردی بوده و پس از تخصیص نهایی عرضه و مشخص شدن مقدار تعلق یافته به شما، الباقی وجه به موجودی کیف پول ETF شما منظور خواهد شد.`,
          `34-\tتوجه داشته باشید مبلغ اخذ شده از شما در روش «سرمایه‌گذاری از طریق درگاه بانکی» تا زمان عرضه در موجودی کیف پول ETF شما بوده و در صورت درخواست برداشت از کیف پول و یا ثبت درخواست سرمایه‌گذاری در سایر ابزارهای سرمایه‌گذاری قابل معامله در بورس مصرف شده و نهایتا در روز عرضه امکان تخصیص عرضه اولیه برای شما مقدور نخواهد بود. لذا دقت نمایید موجودی کیف پول شما در روز عرضه به مقدار کافی مانده داشته باشد.`,
          `35-\tدر نظر داشته باشید از زمان ثبت درخواست مشارکت در عرضه اولیه تا زمان نهایی شدن درخواست در روز عرضه، وضعیت سفارش به صورت «ثبت درخواست» قابل مشاهده خواهد بود. پس از انجام عرضه، وضعیت "تأیید" یا «رد سیستم» نمایش داده خواهد شد.`,
          `36-\tچنانچه کاربر همزمان با سرویس مدیریت ثروت دیجی پی، از طریق سایر روش ها و کارگزاری ها نسبت به ثبت درخواست عرضه اولیه اقدام نماید، تنها یکی از درخواست های وی به‌صورت تصادفی و مطابق رویه‌های سازمان بورس، شرکت‌های بورس و شرکت سپرده‌گذاری مرکزی اوراق بهادار انجام خواهد شد.`,
          `37-\tکاربران با پذیرش موارد فوق،مسئولیت کلیه ریسک‌های ناشی از ارسال درخواست عرضه اولیه را پذیرفته و آگاهی از کلیه موارد مربوطه از قبیل مستندات عرضه اولیه، ابلاغیه های سازمان بورس و شرکت های بورس و مستندات افشا شده در سامانه کدال را اذعان میدارد.`,
          `38-\tنقدشوندگی سهام تابع شرایط بازار سرمایه است و مسئولیتی از این حیث متوجه دیجی‌پی نیست.
با عنایت به فرآیند‌های سیستمی و نرم‌افزاری، اخذ درخواست مشارکت در عرضه اولیه و ارسال این درخواست‌ها به کارگزاری به منزله ثبت نهایی سفارش شما نبوده و در صورت بروز هرگونه مشکل در فرآیند مذکور، دیجی‌پی مسئولیتی در این خصوص نخواهد داشت.
`,
        ],
      },
      {
        title: `فصل پنجم: مقررات صندوق‌های ETF`,
        value: [
          `39-\tخرید و فروش واحدهای سرمایه‌گذاری صندوق‌های سرمایه‌گذاری قابل معامله در بورس (ETF) از طریق ارسال درخواست کاربران به کارگزاری و از طریق انجام معامله در سامانه معاملات بورس اوراق بهادار صورت می‌پذیرد. دیجی‌پی صرفاٌ نسبت به دریافت و ارسال درخواست کاربران به کارگزاری اقدام می‌نماید و هیچ‌گونه نقش و تأثیری در اجرا یا عدم اجرا و کیفیت اجرای این درخواست‌ها به هر نوع ندارد.`,
          `40-\tمهلت اعتبار درخواست خرید و فروش کاربر که توسط دیجی‌پی به کارگزاری ارسال می‌گردد تا 7 روز بعد از ثبت درخواست بوده و درصورتی که به هر نحو سفارش خرید یا فروش طی مهلت مذکور اجرا نشود سفارش یادشده منقضی ‌می‌گردد.`,
          `41-\tثبت سفارش خرید و فروش برای صندوق‌های سرمایه‌گذاری قابل معامله به معنای مطالعه کامل و پذیرش مفاد امیدنامه و اساسنامه هر صندوق و قوانین و دستورالعمل‌های مربوط به انجام معاملات در بورس‌ها بوده و کابر اذعان می‌دارد نسبت به کلیه ریسک سرمایه‌گذاری و معاملاتی مصرّح در مستندات یادشده آگاه گردیده است.`,
          `42-\tدر صورت عدم اجراء سفارش‌های کاربر طی مهلت 7 روزه فوق به هر علت، دیجی‌پی مسئولیتی در قبال ارسال مجدد سفارش بدون درخواست جدید کاربر ندارد.`,
          `43-\tاجراء هرگونه سفارش خرید و فروش کاربران توسط کارگزاری منوط به طی شدن فرآیند تعریف مشتری ( RQ شدن مشتری) از طریق کارگزاری و شرکت سپرده‌گذاری مرکزی اوراق بهادار و تسویه وجوه می‌باشد.`,
          `44-\tدرصورتی که کاربر برای اولین بار پیش از ساعت 15 هر روز کاری نسبت به ثبت درخواست خرید از طریق دیجی‌پی اقدام نماید، حساب کاربری وی حداقل یک روز کاری بعد و پس از انجام فرآیند تعریف مشتری و چنانچه پس از ساعت 15 هر روز کاری اقدام نماید حداقل دو روز کاری بعد معاملاتی خواهد شد.`,
          `45-\tسفارش‌های خرید و فروش ارسالی به کارگزاری از نوع "سفارش با قیمت باز" ‌می‌باشد که این نوع سفارشات مطابق با دستورالعمل‌های اجرایی نحوه انجام معاملات در بورس‌ها بدون تعیین قیمت وارد سامانه معاملات شده و با قیمت بهترین سفارش طرف مقابل اجرا می‌شود. در صورت اجرا نشدن بخشی از سفارش، به‌صورت یک سفارش با قیمت باز در سامانه باقی خواهد ماند. به عبارت دیگر ممکن است معامله مورد تقاضای کاربر با نرخی بیشتر یا کمتر از مبلغ مورد تقاضا انجام شود و از این حیث هیچگونه مسئولیتی متوجه دیجی‌پی نخواهد بود.`,
          `46-\tدر صورت فروش دارایی به درخواست کاربر، وجوه حاصل از فروش به کیف پول کاربر نزد کارگزاری واریز شده و کاربر می‌بایست در صورت لزوم، نسبت به ثبت درخواست برداشت وجه از کیف پول خود اقدام نماید.`,
          `47-\tدر صورتی‌که شماره حساب اعلام شده از سوی کاربر در سامانه سجام مربوط به حساب مشترک یا مسدود  باشد و یا دارای هر نوع محدودیت باشد یا در آینده دچار محدودیت گردد، درخواست برداشت وجه از کیف پول کاربر موفق نخواهد بود. لذا مسئولیت پیگیری درخواست برداشت وجه و معرفی حساب بانکی بدون هر نوع محدودیت بر عهده کاربر است.`,
          `48-\tکاربر با مطالعه و تأیید این متن، درخواست فریز کردن دارایی‌های خریداری شده را به کارگزاری اعطاء می‌نماید. با فریز شدن دارایی، امکان فروش دارایی تنها از طریق سرویس مدیریت ثروت دیجی‌پی و کارگزاری طرف قرارداد آن وجود خواهد داشت.`,
          `49-\tکاربر با هر بار ارسال درخواست خرید یا فروش دارایی از طریق دیجی‌پی، درخواست تغییر کارگزار ناظر آن دارایی به کارگزاری طرف قرارداد سرویس مدیریت ثروت دیجی‌پی را ارسال می‌کند.`,
          `50-\tچنانچه کاربر از طریق سایر پلتفرم‌ها و وب‌سایت‌ها درخواست تغییر کارگزار ناظر یا فریز دارایی مورد معامله در دیجی‌پی را ارائه نماید، امکان فروش آن دارایی از طریق دیجی‌پی برای وی وجود نداشته و مسئولیت هرگونه ضرر و زیان ناشی از این مورد بر عهده کاربر خواهد بود.`,
          `51-\tدر صورت ثبت درخواست برداشت وجه توسط کاربر، فرآیند اجرایی و همچنین زمان واریز وجه، تابع ضوابط و مقررات داخلی کارگزاری و شرکت سپرده‌گذاری مرکزی اوراق بهادار و تسویه وجوه بوده و دیجی‌پی نقشی در تسریع و یا تأخیر در این امر ندارد.`,
          `52-\tدر صورتی که کاربر نسبت به برداشت مانده کیف پول خود نزد کارگزاری اقدام نماید، مبلغ مذکور به حساب بانکی متصل به سجام کاربر واریز خواهد شد.`,
          `53-\tدر صورتی که صندوق سرمایه‌گذاری با درامد ثابت خریداری شده توسط کاربر از نوع با تقسیم سود دوره‌ای باشد، سود دوره‌ای یادشده توسط شرکت سپرده‌گذاری مرکزی اوراق بهادار و تسویه وجوه به حساب بانکی متصل به سجام کاربر واریز خواهد شد.`,
          `54-\tهرگونه واریز وجه توسط کارگزاری به حساب بانکی کاربر، صرفاً با  درخواست کاربر و به حساب بانکی متصل به سجام صورت خواهد پذیرفت. دیجی‌پی هیچ‌گونه مجوز و دسترسی برای تغییر شماره حساب مذکور ندارد. اعمال این تغییرات می‌بایست از طریق ویرایش اطلاعات در سامانه سجام صورت پذیرد.`,
          `55-\tدارایی‌های قابل معامله در بورس یا ETF در بازه‌های زمانی که توسط هر یک از بورس‌ها ( بسته به نوع صندوق) تعیین و اعلام می‌گردد، قابلیت معامله شدن را دارند. لذا درصورتی که کاربر سفارش‌های خرید و فروش خود را حداکثر تا 30 دقیقه قبل از اتمام بازه مجاز معاملاتی هر صندوق سرمایه‌گذاری ثبت نماید و قبلا در سامانه کارگزاری نیز ثبت‌نام و تعریف مشتری شده باشد، درخواست وی توسط کارگزار در همان روز کاری در سامانه معاملات ثبت خواهد شد. در غیر اینصورت ثبت سفارش در سامانه معاملات به روزهای کاری بعد موکول خواهد شد.`,
        ],
      },
      {
        title: 'فصل ششم: سایر مقررات',
        value: [
          `56-\tدر صورت بروز شرایط بحرانی، فورس ماژور، بسته شدن نماد به هر دلیل از سمت بورس، «صف خرید» و «صف فروش» یا بروز خطا در زیرساخت‌های مورد استفاده، زمان‌بندی‌های اعلامی در خصوص کیفیت اجراء سفارش‌ها در بندهای فوق غیر معتبر بوده و اجراء سفارش‌ها تابع وضعیت تابلوی معاملات در نماد مورد نظر و متوقف به متعادل شدن وضعیت عرضه و تقاضا می‌باشد. کارگزار و دیجی‌پی در این شرایط مسئولیتی نخواهند داشت.`,
          `57-\tانجام معاملات خرید و فروش مشمول کارمزدها و مالیات فروش می‌باشد و اخذ آن توسط کارگزاری بر اساس ضوابط و مقررات اعلامی سازمان بورس و اوراق بهادار است و کاربر آگاه است که دیجی‌پی در این خصوص دخالتی ندارد.`,
          `58-\tدرصورت کافی نبودن موجودی یا محدودیت‌های معاملاتی، ممکن است انجام سفارش به میزانی کمتر از مبلغ درخواستی انجام شود.`,
          `59-\tدیجی‌پی هیچگونه مسئولیتی نسبت به سود یا زیان کاربر ناشی از سفارشات و معاملات وی در بورس‌ها نداشته و کلیه مسئولیت معاملات انجام شده به درخواست کاربر و بر عهده کاربر است. `,
          `60-\tچنانچه کاربر به هر دلیل از سمت مراجع ذی‌صلاح از قبیل سازمان بورس و اوراق بهادار، شرکت سپرده‌گذاری مرکزی اوراق بهادار و تسویه وجوه، شرکت‌های بورس و ... ممنوع‌المعامله باشد، امکان انجام سفارش کاربر وجود نداشته و مبالغ پرداختی وی بابت خرید دارایی در کیف پول وی نزد کارگزاری حفظ خواهد شد.`,
          `61-\tتداوم استفاده کاربر از خدمات مدیریت ثروت دیجی‌پی به منزله مطالعه و پذیرش شرایط مندرج در سند حاضر و تغییرات مندرج در آن است. با توجه به اینکه نمایش متن حاضر به منزله ایجاب دیجی‌پی است، تائید و پذیرش تعهدات و شرایط استفاده حاضر از سوی کاربر به منزله قبول قوانین و مقررات در متن حاضر و همچنین تائید الکترونیکی قراردادهای مرتبط و پیوست در لینک‌های سرویس مدیریت ثروت بوده و این مقررات و تعهدات به منظور ارائه هرگونه خدمات قابل دریافت از طریق نرم‌افزار و پلتفرم و وب سایت دیجی‌پی مورد قبول قرار گرفته است.`,
          `62-\tسرویس مدیریت ثروت دیجی‌پی می‌تواند شرایط و نحوه استفاده را به‌روزرسانی نماید. در صورت به‌روزرسانی، استمرار استفاده کاربر یا عدم درخواست رسمی مسدودی اکانت از سوی کاربر بلافاصله پس از به‌روزرسانی، به معنی پذیرش تغییرات از سوی کاربر است.`,
        ],
      },
    ],
  });

  onBackHandler(): void {
    this.location.back();
  }
}

interface ITermsAndConditionsComponent {
  title: string;
  value: string[];
  items?: ITermsAndConditionsComponent[];
}
