import { TermsDataModel } from './models/terms-data.model';

export const TERMS_DATA: TermsDataModel = {
  foreword: 'این سند، مشتمل بر شرایط استفاده کاربران از خدمات بیمه دیجی‌پی است. پیشنهاد می‌شود باتوجه به ابعاد حقوقی سند، پیش از پذیرش شرایط و استفاده از خدمات بیمه‌ای دیجی‌پی، نسبت به مطالعه دقیق این شرایط، اقدام نمایید.',
  items: [
    {
      title: 'هویت کاربر',
      clauses: [
        'مقصود از کاربر (بیمه‌گزار) در این سند، شخصی است که متقاضی دریافت خدمات بیمه از دیجی‌پی است و با عضویت در اپلیکیشن یا تارنمای دیجی‌پی و وارد نمودن مشخصات خود، تقاضای دریافت خدمات بیمه‌ای از دیجی‌پی را دارد.\n' +
        'کاربرانی که به هر روشی از خدمات بیمه‌ای دیجی‌پی استفاده می‌کنند، باید از اهلیت قانونی جهت انجام معامله برخوردار باشند. کاربر متعهد است اطلاعات صحیح و کامل خود یا شرکت خود را در زمان ثبت‌نام وارد کند. همچنین متعهد است از پست الکترونیک یا شماره تلفن همراه یا اطلاعات هویتی شخص یا اشخاص حقیقی یا حقوقی دیگر استفاده نکند.\n' +
        'کاربر با پذیرش این سند ابراز می‌دارد که به سن 18 سال تمام خورشیدی رسیده و دارای اهلیت قانونی است. بدیهی است دیجی‌پی هیچ مسئولیتی در برابر کاربرانی که کمتر از 18 سال سن دارند یا از اهلیت قانونی برخوردار نیستند یا اطلاعات نادرست ابراز می‌کنند، ندارد.',
        'مقصود از کاربر (بیمه‌گزار) در این سند، شخصی است که متقاضی دریافت خدمات بیمه از دیجی‌پی است و با عضویت در اپلیکیشن یا تارنمای دیجی‌پی و وارد نمودن مشخصات خود، تقاضای دریافت خدمات بیمه‌ای از دیجی‌پی را دارد.\n' +
        'کاربرانی که به هر روشی از خدمات بیمه‌ای دیجی‌پی استفاده می‌کنند، باید از اهلیت قانونی جهت انجام معامله برخوردار باشند. کاربر متعهد است اطلاعات صحیح و کامل خود یا شرکت خود را در زمان ثبت‌نام وارد کند. همچنین متعهد است از پست الکترونیک یا شماره تلفن همراه یا اطلاعات هویتی شخص یا اشخاص حقیقی یا حقوقی دیگر استفاده نکند.\n' +
        'کاربر با پذیرش این سند ابراز می‌دارد که به سن 18 سال تمام خورشیدی رسیده و دارای اهلیت قانونی است. بدیهی است دیجی‌پی هیچ مسئولیتی در برابر کاربرانی که کمتر از 18 سال سن دارند یا از اهلیت قانونی برخوردار نیستند یا اطلاعات نادرست ابراز می‌کنند، ندارد.     ',
        'مقصود از کاربر (بیمه‌گزار) در این سند، شخصی است که متقاضی دریافت خدمات بیمه از دیجی‌پی است و با عضویت در اپلیکیشن یا تارنمای دیجی‌پی و وارد نمودن مشخصات خود، تقاضای دریافت خدمات بیمه‌ای از دیجی‌پی را دارد.\n' +
        'کاربرانی که به هر روشی از خدمات بیمه‌ای دیجی‌پی استفاده می‌کنند، باید از اهلیت قانونی جهت انجام معامله برخوردار باشند. کاربر متعهد است اطلاعات صحیح و کامل خود یا شرکت خود را در زمان ثبت‌نام وارد کند. همچنین متعهد است از پست الکترونیک یا شماره تلفن همراه یا اطلاعات هویتی شخص یا اشخاص حقیقی یا حقوقی دیگر استفاده نکند.\n' +
        'کاربر با پذیرش این سند ابراز می‌دارد که به سن 18 سال تمام خورشیدی رسیده و دارای اهلیت قانونی است. بدیهی است دیجی‌پی هیچ مسئولیتی در برابر کاربرانی که کمتر از 18 سال سن دارند یا از اهلیت قانونی برخوردار نیستند یا اطلاعات نادرست ابراز می‌کنند، ندارد. '
      ],
    },
    {
      title: 'خدمات بیمه دیجی‌پی',
      clauses: [
        'دیجی‌پی یک شرکت بیمه‌گر نیست، بلکه صرفا واسطه نرم افزاری ارائه خدمات بیمه از سوی شرکت‌های بیمه‌گر است. کلیه تعهدات ناظر بر بیمه نامه‌ها بر عهده تامین کننده بیمه، بیمه‌گر، نماینده یا کارگزار بیمه است و دیجی‌پی رأساً مسئولیتی در قبال شیوه ارائه خدمت توسط بیمه‌گر ندارد. دیجی‌پی صرفاً بستری برای اطلاع رسانی  و ارتباط میان شرکت‌های بیمه‌گر، نماینده یا کارگزار بیمه و بیمه‌گزار است. \n' +
        'کاربر پیش از امضای هر قرارداد باید تمام مفاد آن قرارداد را به‌ویژه موارد تحت پوشش بیمه، استثنائات و حدود مسئولیت بیمه‌گران مطالعه کند. در هر صورت امضا یا پرداخت حق بیمه قرارداد به منزله آگاهی کامل از مفاد آن بوده و کاربر نمی‌تواند به عدم علم و آگاهی خود نسبت به آن استناد کند.\n' +
        'کاربر باید شخصا در خصوص تمدید بیمه ‌نامه‌های خود اقدام کند و دیجی‌پی مسئولیتی نسبت به عدم تمدید بیمه کاربران در مهلت‌های مقرری که توسط شرکت‌های بیمه اعلام می‌شود یا مسئولیتی در خصوص اطلاع به کاربر در خصوص انقضای مهلت بیمه‌نامه، ندارد.\n' +
        'قیمت‌ها و هزینه‌های نمایش داده در تارنما و اپلیکیشن دیجی‌پی، صرفاً ارقام اعلامی و تأیید شده از سوی شرکت‌های بیمه‌گر هستند و دیجی‌پی دخل و تصرفی در خصوص این قیمت‌ها ندارد. اگرچه قیمت‌های مزبور نافی حق امکان اخذ هزینه ارائه خدمات به کاربر برای دیجی‌پی نیست.\n',
        'دیجی‌پی یک شرکت بیمه‌گر نیست، بلکه صرفا واسطه نرم افزاری ارائه خدمات بیمه از سوی شرکت‌های بیمه‌گر است. کلیه تعهدات ناظر بر بیمه نامه‌ها بر عهده تامین کننده بیمه، بیمه‌گر، نماینده یا کارگزار بیمه است و دیجی‌پی رأساً مسئولیتی در قبال شیوه ارائه خدمت توسط بیمه‌گر ندارد. دیجی‌پی صرفاً بستری برای اطلاع رسانی  و ارتباط میان شرکت‌های بیمه‌گر، نماینده یا کارگزار بیمه و بیمه‌گزار است. \n' +
        'کاربر پیش از امضای هر قرارداد باید تمام مفاد آن قرارداد را به‌ویژه موارد تحت پوشش بیمه، استثنائات و حدود مسئولیت بیمه‌گران مطالعه کند. در هر صورت امضا یا پرداخت حق بیمه قرارداد به منزله آگاهی کامل از مفاد آن بوده و کاربر نمی‌تواند به عدم علم و آگاهی خود نسبت به آن استناد کند.\n' +
        'کاربر باید شخصا در خصوص تمدید بیمه ‌نامه‌های خود اقدام کند و دیجی‌پی مسئولیتی نسبت به عدم تمدید بیمه کاربران در مهلت‌های مقرری که توسط شرکت‌های بیمه اعلام می‌شود یا مسئولیتی در خصوص اطلاع به کاربر در خصوص انقضای مهلت بیمه‌نامه، ندارد.\n' +
        'قیمت‌ها و هزینه‌های نمایش داده در تارنما و اپلیکیشن دیجی‌پی، صرفاً ارقام اعلامی و تأیید شده از سوی شرکت‌های بیمه‌گر هستند و دیجی‌پی دخل و تصرفی در خصوص این قیمت‌ها ندارد. اگرچه قیمت‌های مزبور نافی حق امکان اخذ هزینه ارائه خدمات به کاربر برای دیجی‌پی نیست.\n',
        'دیجی‌پی یک شرکت بیمه‌گر نیست، بلکه صرفا واسطه نرم افزاری ارائه خدمات بیمه از سوی شرکت‌های بیمه‌گر است. کلیه تعهدات ناظر بر بیمه نامه‌ها بر عهده تامین کننده بیمه، بیمه‌گر، نماینده یا کارگزار بیمه است و دیجی‌پی رأساً مسئولیتی در قبال شیوه ارائه خدمت توسط بیمه‌گر ندارد. دیجی‌پی صرفاً بستری برای اطلاع رسانی  و ارتباط میان شرکت‌های بیمه‌گر، نماینده یا کارگزار بیمه و بیمه‌گزار است. \n' +
        'کاربر پیش از امضای هر قرارداد باید تمام مفاد آن قرارداد را به‌ویژه موارد تحت پوشش بیمه، استثنائات و حدود مسئولیت بیمه‌گران مطالعه کند. در هر صورت امضا یا پرداخت حق بیمه قرارداد به منزله آگاهی کامل از مفاد آن بوده و کاربر نمی‌تواند به عدم علم و آگاهی خود نسبت به آن استناد کند.\n' +
        'کاربر باید شخصا در خصوص تمدید بیمه ‌نامه‌های خود اقدام کند و دیجی‌پی مسئولیتی نسبت به عدم تمدید بیمه کاربران در مهلت‌های مقرری که توسط شرکت‌های بیمه اعلام می‌شود یا مسئولیتی در خصوص اطلاع به کاربر در خصوص انقضای مهلت بیمه‌نامه، ندارد.\n' +
        'قیمت‌ها و هزینه‌های نمایش داده در تارنما و اپلیکیشن دیجی‌پی، صرفاً ارقام اعلامی و تأیید شده از سوی شرکت‌های بیمه‌گر هستند و دیجی‌پی دخل و تصرفی در خصوص این قیمت‌ها ندارد. اگرچه قیمت‌های مزبور نافی حق امکان اخذ هزینه ارائه خدمات به کاربر برای دیجی‌پی نیست.\n',
        'دیجی‌پی یک شرکت بیمه‌گر نیست، بلکه صرفا واسطه نرم افزاری ارائه خدمات بیمه از سوی شرکت‌های بیمه‌گر است. کلیه تعهدات ناظر بر بیمه نامه‌ها بر عهده تامین کننده بیمه، بیمه‌گر، نماینده یا کارگزار بیمه است و دیجی‌پی رأساً مسئولیتی در قبال شیوه ارائه خدمت توسط بیمه‌گر ندارد. دیجی‌پی صرفاً بستری برای اطلاع رسانی  و ارتباط میان شرکت‌های بیمه‌گر، نماینده یا کارگزار بیمه و بیمه‌گزار است. \n' +
        'کاربر پیش از امضای هر قرارداد باید تمام مفاد آن قرارداد را به‌ویژه موارد تحت پوشش بیمه، استثنائات و حدود مسئولیت بیمه‌گران مطالعه کند. در هر صورت امضا یا پرداخت حق بیمه قرارداد به منزله آگاهی کامل از مفاد آن بوده و کاربر نمی‌تواند به عدم علم و آگاهی خود نسبت به آن استناد کند.\n' +
        'کاربر باید شخصا در خصوص تمدید بیمه ‌نامه‌های خود اقدام کند و دیجی‌پی مسئولیتی نسبت به عدم تمدید بیمه کاربران در مهلت‌های مقرری که توسط شرکت‌های بیمه اعلام می‌شود یا مسئولیتی در خصوص اطلاع به کاربر در خصوص انقضای مهلت بیمه‌نامه، ندارد.\n' +
        'قیمت‌ها و هزینه‌های نمایش داده در تارنما و اپلیکیشن دیجی‌پی، صرفاً ارقام اعلامی و تأیید شده از سوی شرکت‌های بیمه‌گر هستند و دیجی‌پی دخل و تصرفی در خصوص این قیمت‌ها ندارد. اگرچه قیمت‌های مزبور نافی حق امکان اخذ هزینه ارائه خدمات به کاربر برای دیجی‌پی نیست.\n'
      ],
    },
    {
      title: 'رعایت حریم خصوصی',
      clauses: [
        'دیجی‌پی در حد توان ملزم به حفظ حریم خصوصی و رازداری اطلاعات شخصی است که در راستای ارائه خدمات خود از کاربر دریافت می‌کند. در عین حال کاربر این اجازه را به دیجی‌پی می‌دهد که به‌منظور ارتقاء و توسعه سطح خدمات خود از اطلاعات کاربران به صورت تجمیعی و تحلیلی استفاده نماید.\n' +
        'با توجه به اینکه اطلاعات کاربران به بیمه‌گر ارائه خواهد شد، حفظ این اطلاعات بر اساس ضوابط و قوانین بیمه مرکزی جمهوری اسلامی ایران بر عهده بیمه‌گر است و دیجی پی در این خصوص مسئولیتی ندارد.\n' +
        'در صورتی که از سوی هریک از نهادها و سازمان‌ها و مراجع ذیصلاح قانونی درخواستی مبنی بر دریافت اطلاعات و گردش مالی و تراکنش‌های کاربر ارائه شود، شرکت به موجب قوانین و مقررات مجاز به ارائه اطلاعات است.',
        'با توجه به اینکه اطلاعات کاربران به بیمه‌گر ارائه خواهد شد، حفظ این اطلاعات بر اساس ضوابط و قوانین بیمه مرکزی جمهوری اسلامی ایران بر عهده بیمه‌گر است و دیجی پی در این خصوص مسئولیتی ندارد.',
        'در صورتی که از سوی هریک از نهادها و سازمان‌ها و مراجع ذیصلاح قانونی درخواستی مبنی بر دریافت اطلاعات و گردش مالی و تراکنش‌های کاربر ارائه شود، شرکت به موجب قوانین و مقررات مجاز به ارائه اطلاعات است.'
      ],
    },
    {
      title: 'حقوق و تکالیف کاربر',
      clauses: [
        'عضویت کاربر در دیجی‌پی به معنی تأیید اعمال و اظهارات کاربر نیست و شرکت فقط در حدود موضوع فعالیت خود با کاربران ارتباط دارد.',
        'با‌توجه‌ به محدودیت‌ها، مشکلات و اختلالات احتمالی در شبکۀ بانکی و شرایط خاص، ممکن است درخواست واریز وجه یا ارائه خدمت با تأخیر مواجه شود. دیجی‌پی عدم بروز اشکال یا قطعی در شبکۀ بانکی را تضمین نمی‌کند. بدین وسیله کاربر موافقت می‌کند که در صورت بروز مشکل، مسئولیتی متوجه دیجی پی نیست.',
        'در‌صورتی‌که پرداخت کاربر به‌صورت ناموفق انجام پذیرد و مبلغ از حساب کاربر کسر شده باشد، این مبلغ طی ۷۲ ساعت پس از پرداخت به حساب پرداخت‌کننده مسترد می‌شود. در صورت عدم استرداد طی ۷۲ ساعت، کاربر باید اطلاعات دقیق پرداخت را به وسیله راه‌های ارتباطی به پشتیبانی دیجی‌پی اعلام کند تا بررسی و پیگیری‌های لازم انجام پذیرد. بدیهی است شروع پوشش بیمه‌ای توسط دیجی‌پی به کاربر اعلام می‌گردد و تا هنگامی که این امر به کاربر اعلام نشده باشد، خدمات بیمه‌ای قابل ارائه نخواهد بود و کاربر ادعایی در این خصوص نخواهد داشت.',
        'در صورت بروز تخلف از سوی کاربر و یا آنکه دیجی‌پی فعالیت صورت گرفته را مشکوک تشخیص دهد، دیجی پی می‌تواند بدون اطلاع رسانی پیشینی، مبالغ موجود در حساب کاربری شخص را مسدود کند. آزادسازی مبلغ مشروط به انجام بررسی‌های لازم توسط دیجی‌پی یا سایر مراجع قانونی و یا حسب مورد دستور مراجع ذی‌صلاح است.',
        'دیجی‌پی دارای سیستم پیشرفته مانیتورینگ جهت بررسی فعالیت‌های کاربران است. در صورتی که کاربر اقدام به عملیات خرابکارانه مانند اجرای نرم افزار، اسکریپت و یا حتی یک تغییر پارامتر در مسیر، جهت تست، بررسی و یا با هر عنوانی نماید، پس از اطلاع، علاوه بر مجوز دیجی‌پی مبنی بر مسدودسازی کامل دسترسی کاربر و اضافه شدن مشخصات به لیست سیاه، حق دیجی‌پی برای ارسال اطلاعات موجود به همراه آی پی و دیگر مشخصات کاربر جهت پیگیری قضایی به مراجع ذیصلاح محفوظ خواهد بود.',
        'کاربر متعهد به حفظ محرمانگی و عدم افشای اطلاعات و قراردادهایی است که دیجی‌پی در اختیار وی قرار می‌دهد و نمی‌تواند از آنها جهت آسیب زدن به عملکرد سایت و شرکت یا استفاده تجاری خود یا ثالت استفاده نماید.',
        'کاربر ممکن است برای استفاده از برخی خدمات دیجی‌پی نیازمند کسب مجوزهای قانونی باشد. لذا کاربر باید پیش از اقدام به پرداخت و انعقاد قرارداد با دیجی‌پی از این موارد آگاهی یابد و دیجی‌پی مسئولیتی از بابت عدم امکان ارائه خدمات به علت نداشتن مجوز مورد نیاز کاربر نخواهد داشت.',
        'کاربر مکلف به ارائه اطلاعات صحیح در هنگام ثبت‌نام و دریافت خدمات از اپلیکیشن و تارنمای دیجی‌پی است. در صورت ورود خسارت ناشی از اشتباه کاربر در وارد کردن اطلاعات به کاربر، مسئولیتی متوجه دیجی‌پی یا بیمه‌گر نیست و کلیه مسئولیت‌های احتمالی برعهده شخص کاربر است. در عین حال در صورت ورود خسارت به دیجی‌پی یا بیمه‌گر که ناشی از ورود اشتباه اطلاعات یا سهل‌انگاری کاربر در ارائه اطلاعات صحیح و دقیق باشد، مسئولیت جبران خسارت‌های احتمالی متوجه کاربر است.',
        'دیجی‌پی می تواند از نام و علامت تجاری کاربران جهت بازاریابی و دیگر اهداف تجاری در حدود موضوع فعالیت خود استفاده کند و در این خصوص استفاده کننده از خدمات دیجی‌پی نمی‌تواند ادعای نقض حق داشته باشد.',
      ],
    },
    {
      title: 'مالکیت فکری',
      clauses: [
        'کلیه حقوق مادی و معنوی ثبت شده و نشده دیجی‌پی، شامل و نه محدود به علائم تجاری، اجزای فنی اپلیکیشن، رابط کاربری، رابط بصری، طرح‌های گرافیکی و جزئیات هویت برند دیجی‌پی و حق هرگونه استفاده و بهره‌برداری انحصاری از آن متعلق به شرکت نوآوران پرداخت مجازی ایرانیان (سهامی خاص) به شماره ثبت ۵۲۷۸۰۳ است که علامت تجاری دیجی‌پی را به دو زبان فارسی و انگلیسی به ثبت رسانده و کاربر مجاز به استفاده از آن‌ها برای هیچ‌ کاربردی از جمله کاربردهای شخصی و تجاری نخواهد بود.',
        'هرگونه کپی برداری یا استفاده غیر مجاز از نام، مطالب، مستندات و علائم تجاری دیجی‌پی بدون مجوز کتبی این شرکت و سعی در نفوذ به داده‌های دیجی‌پی، مطابق قوانین جاری کشور، غیرمجاز تلقی شده و دیجی پی حق پیگرد قانونی در مراجع ذی صلاح را برای خود محفوظ می‌دارد.'
      ],
    },
    {
      title: 'سایر موارد',
      clauses: [
        'در هر مورد که قراردادی در اختیار کاربر قرار می‌گیرد، متن ارائه شده به منزله ایجاب دیجی‌پی است. پس از پذیرش متن از سوی کاربر، یک قرارداد الزام آور و معتبر میان کاربر و دیجی‌پی منعقد می‌شود و طرفین ملزم به رعایت تعهدات و تمام شروطی که در آن قید شده خواهند بود. زمان مؤثر یا زمان انعقاد عقد زمانی است ایجاب دیجی‌پی توسط کاربر پذیرفته می‌شود. قراردادهایی که به صورت الکترونیک امضا می شوند مطابق با قانون تجارت الکترونیک معتبر بوده و در حکم قراردادهای مکتوب و برای طرفین لازم الاجراست.',
        'دیجی‌پی مسئولیتی در قبال قطع اینترنت یا سرورهای اینترنتی و سایر اختلال‌های موجود در شبکه اینترنت که مانع استفاده کاربر می‌گردد یا ممکن است خسارتی به کاربر وارد سازد، ندارد.\n' +
        'این موافقت نامه از هر حیث تابع قوانین و مقررات جمهوری اسلامی ایران است.',
        'در صورت وجود هرگونه پرسش یا نیاز به راهنمایی، کاربران می‌توانند ۷ روز هفته، از ساعت ۸ تا ۲۴ از طریق پست الکترونیک support@mydigipay.com و یا شماره تلفن 02161930400 با دیجی‌پی در تماس باشند.',
        'دیجی‌پی حق اصلاح و تغییر شرایط این موافقت‌نامه را در هر زمان دارد و پس از اعلام تغییرات ، تداوم استفاده کاربر ازخدمات بیمه دیجی‌پی به‌معنی پذیرش همۀ تغییرات است.',
      ]
    }
  ]
};
