import { ChangeDetectionStrategy, Component, computed, signal } from '@angular/core';
import { NgxButtonComponent } from '@digipay/ngx-button';
import { NgxIcon } from '@digipay/ngx-icon';

export interface FaqItem {
  question: string;
  answer: string;
  itemId?: string;
  link?: { title: string; url: string };
}

@Component({
  selector: 'app-bnpl-landing-q-and-a-section',
  templateUrl: './bnpl-landing-q-and-a-section.component.html',
  styleUrls: ['./bnpl-landing-q-and-a-section.component.scss'],
  standalone: true,
  imports: [NgxButtonComponent, NgxIcon],
  changeDetection: ChangeDetectionStrategy.OnPush,
})
export class BnplLandingQAndASectionComponent {
  title = 'سوالات متداول';

  subtitle = 'ممكنه جواب سوالت اينجا باشه';

  faqs: FaqItem[] = [
    {
      question: 'سرویس اعتبار اقساطی چیست؟',
      answer:
        'با استفاده از این سرویس، بسته به امتیاز اعتباری‌تان، مقداری اعتبار به شما اختصاص می‌یابد که می‌توانید با آن از فروشگاه‌های پذیرنده دیجی‌پی (دیجی‌کالا ، دیجی کالا جت و اتاقک) خرید و یکم تا پنجم ماه بعد اعتبار استفاده شده را تسویه کنید. این سرویس به کاربرانی تعلق می‌گیرد که امکان‌سنجی را با موفقیت طی کنند.',
    },
    {
      question: 'برای دریافت سرویس اعتبار اقساطی دیجی‌پی به ضامن نیاز دارم؟',
      answer: 'خیر؛ برخورداری از سرویس اعتباراقساطی دیجی‌پی در حال حاضر نیازی به ضامن ندارد.',
    },
    {
      question: 'چگونه می‌توانم برای اولین بار سرویس اعتباراقساطی را فعال کنم؟',
      answer:
        'اگر پیش از این سرویس اعتباری را امتحان نکرده‌اید کافی‌ست هنگام خرید از فروشگاه‌های پذیرنده دیجی‌پی (دیجی‌کالا و دیجی‌کالا جت) اگر ارزش سبد خریدتان زیر ۷۵۰ هزار تومان است، در مرحله پرداخت، در قسمت روش‌های پرداخت، گزینه «پرداخت اعتباری» را انتخاب کنید. بعد از این، با ارائه کد ملی و تاریخ تولد، امکان‌سنجی ارائه خدمات برای شما انجام و در صورتی که واجد شرایط دریافت اعتبار باشید، مبلغ اعتبار متناسب با با رتبه اعتباری برای شما فعال می‌شود.',
    },
    {
      question: 'آیا می‌توانم بیشتر از سقف اعتبار دریافتی خرید کنم؟',
      answer:
        'بله؛ برای مثال اگر اعتبار اختصاص یافته به شما ۳۰۰ هزار تومان باشد، می‌توانید تا سقف اعتبار دریافتی، هزینه بخشی از سبد خرید خود را اعتباری پرداخت کنید و مابقی آن را از کارت بانکی خود بپردازید.',
    },
    {
      question: 'با سرویس پرداخت اعتباری دیجی‌پی چه خدمات و محصولاتی را می‌توانم خریداری کنم؟',
      answer:
        'کاربران سرویس پرداخت اعتباری دیجی‌پی در حال حاضر می‌توانند برای خرید تمام محصولات دیجی کالا و دیجی کالا جت به‌جز کالاهای خدماتی (کارت هدیه و دیجی پلاس و بیمه) و سرویس رزرو آنلاین سایت اتاقک، از اعتبار این سرویس استفاده کنند.',
    },
    {
      question: 'چه‌طور می‌توانم بدهی‌ام را تسویه کنم؟',
      answer:
        'کافی‌ست در اپلیکیشن دیجی‌پی یا نسخه تحت وب آن به بخش «خرید اعتباری» مراجعه یا روی کارت "اعتبار من" کلیک کنید. جزییات اعتباری، مبلغ بدهی و لینک تسویه بدهی در دسترس شما خواهد بود. لینک دانلود اپلیکیشن دیجی‌پی: <a class="link" href="https://www.mydigipay.com/download/">دانلود</a>',
    },
    {
      question: 'چند روز برای تسویه بدهی‌ام مهلت دارم؟',
      answer:
        'مهلت تسویه و پرداخت بدهی برای تمام کاربران از یکم تا پنجم ماه بعد از استفاده از اعتبار در نظر گرفته شده است.در صورت پرداخت نشدن به موقع بدهی، بدهی شما مشمول جریمه روزشمار خواهد شد.',
    },
    {
      question: 'در صورت پرداخت نشدن به موقع بدهی چه اتفاقی می‌افتد؟',
      answer:
        'کاربرانی که بعد از پایان مهلت پرداخت، بدهی خود را می‌پردازند، متناسب با تعداد روزهای دیرکرد، بازپرداخت‌شان مشمول جریمه روزشمار با نرخ 0.25% خواهد شد.',
    },
    {
      question: 'در صورتی که اصلا بدهی را پرداخت نکنم چه اتفاقی خواهد افتاد؟',
      answer:
        'در صورتی‌که کاربری بدهی خود را پرداخت نکند، علاوه بر این که نمی‌تواند از سرویس پرداخت اعتباری دیجی‌پی و برخی دیگر ازخدمات شرکت‌های طرف قرارداد دیجی‌کالا استفاده کند، بدحسابی او به مراجع رتبه‌بندی و اعتبارسنجی بانکی گزارش داده خواهد شد.',
    },
    {
      question: 'آیا اعتبار این سرویس قابل تمدید است؟',
      answer:
        'شما پس از دریافت اعتبار تا تاریخ انقضای اعتبار خود فرصت دارید از آن استفاده کنید و با بازپرداخت به‌موقع بدهی اعتبارتان دوباره شارژ می‌شود.',
    },
    {
      question: 'آیا می‌توانم سقف اعتبارم را افزایش دهم؟',
      answer:
        'بله، با به کارگیری رفتار صحیح در استفاده از این سرویس (استفاده مداوم، پرداخت به موقع بدهی و خوش‌حسابی) اعتبار شما در طول ماه‌های آینده تا سقف یک میلیون تومان امکان افزایش دارد.',
    },
    {
      question: 'اگر از تمام اعتبارم در طول ماه استفاده نکنم، باقی‌مانده اعتبارم به ماه بعد منتقل خواهد شد؟',
      answer: 'بله و مبلغ استفاده شده هم پس از تسویه حساب، مجددا به حساب اعتباری شما اضافه خواهد شد.',
    },
    {
      question: '«خطای در دسترس نبودن سرویس امکان‌سنجی یا سرویس اختصاص اعتبار»، به چه معناست؟',
      answer: 'تا زمان در دسترس قرار گرفتن دوباره سرویس‌ها باید صبر و سپس دوباره تلاش کنید.',
    },
    {
      question: 'برای تسویه بدهی باید تا اول ماه بعد صبر کنم؟',
      answer:
        'خیر، شما می‌توانید هر زمان از ماه جاری بدهی‌تان را پرداخت و دوباره به همان اندازه اعتبار دریافت کنید. همچنین همان‌طور که در اپلیکیشن و نسخه وب دیجی‌پی قابل مشاهده است روی کارت اعتبار اقساطی دیجی‌پی شما یک تاریخ انقضا وجود دارد که پایان مهلت استفاده از اعتبار را نشان می‌دهد.',
    },
    {
      question: 'اعتبارم زود به اتمام رسیده، می‌توانم دوباره آن را شارژ کنم و مجددا اعتبار بگیرم؟',
      answer:
        'بله، شما هر زمانی از ماه که زودتر از موعد بدهی را پرداخت کنید، اعتبارتان به اندازه مبلغ پرداخت شده، شارژ می‌شود و تا روز انقضای اعتبار، می‌توانید از آن استفاده کنید.',
    },
    {
      question: 'پس از لغو سفارش یا مرجوع کردن کالا، اعتبار مصرف شده به چه صورت برگردانده می‌شود؟',
      answer:
        'لغو سفارش یا مرجوع کردن کالا مطابق با قوانین سایتی که از آن خرید می‌کنید، امکان‌پذیر است و بازگشت وجه مطابق قوانین دیجی‌پی است. اگر شما اعتبار مصرف شده را تا قبل از پایان ماه جاری بازپرداخت کرده باشید، مبلغی که از اعتبار هزینه کرده‌اید به اعتبارتان برمی‌گردد و اگر اول ماه بعد پرداخت کرده باشید، مبلغ اعتباری بازگشت داده شده به کیف پول نقدی‌تان بازگردانده می‌شود.' +
        ' توجه داشته باشید که اگر مبلغ اعتبار به کیف پول نقدی‌تان بازگشت، تنها می‌توانید آن را در دیجی‌کالا، دیجی‌کالاجت و دیجی‌پی مصرف کنید و امکان برداشت و انتقال به حساب بانکی وجود نخواهد داشت.',
    },
  ];

  openItemIndex = signal<null | number>(null);
  showAll = signal(false);
  visibleFaqs = computed(() => {
    return this.showAll() ? this.faqs : this.faqs.slice(0, 4);
  });

  showAllButtonText = computed(() => {
    return this.showAll() ? 'نمایش کمتر' : 'مشاهده همه سوالات';
  });

  openItemFaq(index: number | null) {
    if (this.openItemIndex() === index) {
      this.openItemIndex.set(null);
    } else {
      this.openItemIndex.set(index);
    }
  }

  toggleShowAll() {
    this.showAll.update((value) => !value);
    this.openItemIndex.set(null); // Close any open item when toggling
  }
}
